{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise/Replication_log_file_v2.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}15 Dec 2022, 12:09:46
{txt}
{com}. 
. *Part 1: Create mother only data-----------------------------------------------*
. * Drop unnecessary variables
. drop stateus us80a_statefip
{txt}
{com}. 
. * Create unique person IDs to be used for mothers
. tostring us80a_serial us80a_momloc, replace
{txt}us80a_serial was {res:double} now {res:str7}
us80a_momloc has value label; no {res}replace
{txt}
{com}. decode us80a_sploc, gen(us80a_sploc_new)
{txt}
{com}. egen personid = concat (us80a_serial us80a_pernum), punct(_)
{txt}
{com}. save "Replication_data_workingfile.dta", replace
{txt}{p 0 4 2}
file {bf}
Replication_data_workingfile.dta{rm}
saved
{p_end}

{com}. 
. * Create unique mother IDs
. drop if us80a_momloc == 0 //leaving only the children who have a mom
{txt}(7,426,187 observations deleted)

{com}. drop personid
{txt}
{com}. egen personid = concat (us80a_serial us80a_momloc), punct(_) // create a new personid for moms only
{txt}
{com}. duplicates drop personid, force

{p 0 4}{txt}Duplicates in terms of {res} personid{p_end}

{txt}(1,934,507 observations deleted)

{com}. keep us80a_serial personid
{txt}
{com}. save "Replication_data_motheronly.dta", replace
{txt}{p 0 4 2}
file {bf}
Replication_data_motheronly.dta{rm}
saved
{p_end}

{com}. 
. * Merge mothers' data with mothers' person IDs
. merge 1:1 personid using "Replication_data_workingfile.dta", force
{res}{txt}(label {bf:{txt}parrulelbl} already defined)
(label {bf:{txt}agelbl} already defined)
(label {bf:{txt}sexlbl} already defined)
(label {bf:{txt}agemarrlbl} already defined)
(label {bf:{txt}racelbl} already defined)
(label {bf:{txt}hispanlbl} already defined)
(label {bf:{txt}schoollbl} already defined)
(label {bf:{txt}edattanlbl} already defined)
(label {bf:{txt}edattandlbl} already defined)
(label {bf:{txt}yrschllbl} already defined)
(label {bf:{txt}educuslbl} already defined)
(label {bf:{txt}us80a_pernumlbl} already defined)
(label {bf:{txt}us80a_momloclbl} already defined)
(label {bf:{txt}us80a_momrulelbl} already defined)
(label {bf:{txt}us80a_sploclbl} already defined)
(label {bf:{txt}us80a_nchildlbl} already defined)
(label {bf:{txt}us80a_agelbl} already defined)
(label {bf:{txt}us80a_sexlbl} already defined)
(label {bf:{txt}us80a_racelbl} already defined)
(label {bf:{txt}us80a_marstlbl} already defined)
(label {bf:{txt}us80a_agemarrlbl} already defined)
(label {bf:{txt}us80a_marrnolbl} already defined)
(label {bf:{txt}us80a_chbornlbl} already defined)
(label {bf:{txt}us80a_marrqtrlbl} already defined)
(label {bf:{txt}us80a_bpllbl} already defined)
(label {bf:{txt}us80a_hispanlbl} already defined)
(label {bf:{txt}us80a_schoollbl} already defined)
(label {bf:{txt}us80a_higradelbl} already defined)
(label {bf:{txt}us80a_classwkrlbl} already defined)
(label {bf:{txt}us80a_wkswork1lbl} already defined)
(label {bf:{txt}us80a_uhrsworklbl} already defined)
(label {bf:{txt}us80a_widowlbl} already defined)
(label {bf:{txt}us80a_birthqtrlbl} already defined)
(label {bf:{txt}us80a_qagelbl} already defined)
(label {bf:{txt}us80a_qbirthmolbl} already defined)
(label {bf:{txt}us80a_qbpllbl} already defined)
(label {bf:{txt}us80a_qchbornlbl} already defined)
(label {bf:{txt}us80a_qeduclbl} already defined)
(label {bf:{txt}us80a_qincbuslbl} already defined)
(label {bf:{txt}us80a_qincwagelbl} already defined)
(label {bf:{txt}us80a_qsexlbl} already defined)
(label {bf:{txt}us80a_quhrsworlbl} already defined)
(label {bf:{txt}us80a_qwksworklbl} already defined)

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       9,360,694
{txt}{col 9}from master{col 30}{res}               0{txt}  (_merge==1)
{col 9}from using{col 30}{res}       9,360,694{txt}  (_merge==2)

{col 5}Matched{col 30}{res}       1,982,426{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop if _merge != 3
{txt}(9,360,694 observations deleted)

{com}. drop if us80a_age < 21 | us80a_age > 35 
{txt}(1,143,917 observations deleted)

{com}. gen us80a_chborn_new = (us80a_chborn - 1)
{txt}
{com}. drop if (us80a_chborn_new != us80a_nchild) 
{txt}(95,062 observations deleted)

{com}. drop if us80a_nchild < 2 
{txt}(264,933 observations deleted)

{com}. 
. save "Replication_data_motheronly.dta", replace
{txt}{p 0 4 2}
file {bf}
Replication_data_motheronly.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. *Part 2: Merge fathers---------------------------------------------------------*
. * Create unique father IDs (serial + sploc = fathers personid)
. use "Replication_data_workingfile.dta", clear
{txt}
{com}. drop if us80a_sploc_new == "0" | us80a_sex != 1 //only keep male with spouse
{txt}(8,859,857 observations deleted)

{com}. drop personid
{txt}
{com}. egen personid = concat (us80a_serial us80a_sploc_new), punct(_) //personid matched later will be the father's data
{txt}
{com}. keep personid us80a_age us80a_agemarr us80a_birthqtr us80a_classwkr us80a_wkswork1 us80a_uhrswork us80a_incwage us80a_incbus us80a_marst us80a_marrno us80a_marrqtr us80a_qbirthmo
{txt}
{com}. 
. *rename father's variables
. rename (us80a_age us80a_agemarr us80a_birthqtr us80a_classwkr us80a_wkswork1 us80a_uhrswork us80a_incwage us80a_incbus us80a_marst us80a_marrno us80a_marrqtr) (age_father us80a_agemarr_father us80a_birthqtr_father us80a_classwkr_father us80a_wkswork1_father us80a_uhrswork_father us80a_incwage_father us80a_incbus_father us80a_marst_father us80a_marrno_father us80a_marrqtr_father) //renaming variables
{res}{txt}
{com}. save "Replication_data_father.dta", replace
{txt}{p 0 4 2}
file {bf}
Replication_data_father.dta{rm}
saved
{p_end}

{com}. 
. * Import fathers data to mothers' data.
. use "Replication_data_motheronly.dta", clear
{txt}
{com}. drop _merge 
{txt}
{com}. merge 1:1 personid using "Replication_data_father.dta", force
{res}{txt}(label {bf:{txt}us80a_qbirthmolbl} already defined)
(label {bf:{txt}us80a_birthqtrlbl} already defined)
(label {bf:{txt}us80a_uhrsworklbl} already defined)
(label {bf:{txt}us80a_wkswork1lbl} already defined)
(label {bf:{txt}us80a_classwkrlbl} already defined)
(label {bf:{txt}us80a_marrqtrlbl} already defined)
(label {bf:{txt}us80a_marrnolbl} already defined)
(label {bf:{txt}us80a_agemarrlbl} already defined)
(label {bf:{txt}us80a_marstlbl} already defined)
(label {bf:{txt}us80a_agelbl} already defined)

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       2,156,255
{txt}{col 9}from master{col 30}{res}          75,753{txt}  (_merge==1)
{col 9}from using{col 30}{res}       2,080,502{txt}  (_merge==2)

{col 5}Matched{col 30}{res}         402,761{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop if _merge == 2 // drop unmatched fathers
{txt}(2,080,502 observations deleted)

{com}. save "Replication_data_motheronly.dta", replace
{txt}{p 0 4 2}
file {bf}
Replication_data_motheronly.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. *Part 3: Merge children--------------------------------------------------------*
. * Create children ID (pernum + momloc = mother's personid)
. use "Replication_data_workingfile.dta", clear
{txt}
{com}. drop if us80a_momloc == 0 | us80a_momrule != 1
{txt}(7,541,504 observations deleted)

{com}. drop personid
{txt}
{com}. egen personid = concat (us80a_serial us80a_momloc), punct(_)
{txt}
{com}. keep personid us80a_sex us80a_age us80a_birthqtr us80a_qage us80a_qsex us80a_qbirthmo parrule
{txt}
{com}. rename (us80a_sex us80a_age us80a_birthqtr us80a_qage us80a_qsex us80a_qbirthmo parrule) (sex_child age_child us80a_birthqtr_child us80a_qage_child us80a_qsex_child us80a_qbirthmo_child parrule_child)
{res}{txt}
{com}. 
. save "Replication_data_children.dta", replace
{txt}{p 0 4 2}
file {bf}
Replication_data_children.dta{rm}
saved
{p_end}

{com}. 
. * Import children's data to mothers data.*
. use "Replication_data_motheronly.dta", clear
{txt}
{com}. drop _merge // drop existing merge variable
{txt}
{com}. merge 1:m personid using "Replication_data_children.dta", force
{res}{txt}(label {bf:{txt}us80a_qsexlbl} already defined)
(label {bf:{txt}us80a_qbirthmolbl} already defined)
(label {bf:{txt}us80a_qagelbl} already defined)
(label {bf:{txt}us80a_birthqtrlbl} already defined)
(label {bf:{txt}us80a_sexlbl} already defined)
(label {bf:{txt}us80a_agelbl} already defined)
(label {bf:{txt}parrulelbl} already defined)

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       2,650,838
{txt}{col 9}from master{col 30}{res}          13,744{txt}  (_merge==1)
{col 9}from using{col 30}{res}       2,637,094{txt}  (_merge==2)

{col 5}Matched{col 30}{res}       1,164,522{txt}  (_merge==3)
{col 5}{hline 41}

{com}. drop if _merge != 3
{txt}(2,650,838 observations deleted)

{com}. destring us80a_serial, replace
{txt}us80a_serial: all characters numeric; {res}replaced {txt}as {res}long
{txt}
{com}. 
. * Sort child age by household serial number
. gsort us80a_serial - age_child
{txt}
{com}. by us80a_serial: generate child_order = _n
{txt}
{com}. 
. * Drop if number of child born doesn't match with the actual
. by us80a_serial: generate actual_num_child = _N //check
{txt}
{com}. drop if actual_num_child < 2
{txt}(115 observations deleted)

{com}. drop if us80a_chborn_new != actual_num_child
{txt}(388 observations deleted)

{com}. 
. * Reshape 
. drop _merge
{txt}
{com}. reshape wide age_child sex_child us80a_birthqtr_child us80a_qage_child us80a_qsex_child us80a_qbirthmo_child parrule_child , i(us80a_serial) j(child_order)
{txt}(j = 1 2 3 4 5 6 7 8 9)

Data{col 36}Long{col 43}->{col 48}Wide
{hline 77}
Number of observations     {res}   1,164,019   {txt}->   {res}464,518     
{txt}Number of variables        {res}          73   {txt}->   {res}128         
{txt}j variable (9 values)       {res}child_order   {txt}->   (dropped)
xij variables:
                              {res}age_child   {txt}->   {res}age_child1 age_child2 ... age_child9
                              sex_child   {txt}->   {res}sex_child1 sex_child2 ... sex_child9
                   us80a_birthqtr_child   {txt}->   {res}us80a_birthqtr_child1 us80a_birthqtr_child2 ... us80a_birthqtr_child9
                       us80a_qage_child   {txt}->   {res}us80a_qage_child1 us80a_qage_child2 ... us80a_qage_child9
                       us80a_qsex_child   {txt}->   {res}us80a_qsex_child1 us80a_qsex_child2 ... us80a_qsex_child9
                   us80a_qbirthmo_child   {txt}->   {res}us80a_qbirthmo_child1 us80a_qbirthmo_child2 ... us80a_qbirthmo_child9
                          parrule_child   {txt}->   {res}parrule_child1 parrule_child2 ... parrule_child9
{txt}{hline 77}

{com}. 
. * Child age restriction
. drop if age_child2 < 1
{txt}(44,274 observations deleted)

{com}. drop if age_child1 > 17
{txt}(3,589 observations deleted)

{com}. 
. * The reported values of age and sex of their two oldest children were not allocated by the US census
. drop if (us80a_qage_child1 != 0) | (us80a_qage_child2 != 0) | (us80a_qsex_child1 != 0) | (us80a_qsex_child2 != 0) | (us80a_qbirthmo_child1 != 0) | (us80a_qbirthmo_child1 != 0)
{txt}(22,094 observations deleted)

{com}. 
. * Creating "Age at First Birth" variable for moms and dads
. gen age_firstbirth = age - age_child1
{txt}
{com}. gen age_firstbirth_father = age_father - age_child1
{txt}(57,457 missing values generated)

{com}. 
. save "Replication_data_motheronly.dta", replace
{txt}{p 0 4 2}
file {bf}
Replication_data_motheronly.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. * Part 4: Married Couple Restriction ------------------------------------------*
. * Married at the time of first birth - couple
. gen marr_beforebirth = 0
{txt}
{com}. replace marr_beforebirth = 1 if (us80a_agemarr < age_firstbirth)
{txt}(329,286 real changes made)

{com}. 
. * Marriage criteria
. gen married = ((us80a_marst == 1) & (us80a_marst_father == 1) & (marr_beforebirth == 1) & (us80a_marrno == 1))
{txt}
{com}. sum married if married == 1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}married {c |}{res}    251,646           1           0          1          1
{txt}
{com}. 
. * Create child dummies
. gen morethantwo = (actual_num_child > 2)
{txt}
{com}. gen boyfirst = (sex_child1 == 1)
{txt}
{com}. gen boysecond = (sex_child2 == 1)
{txt}
{com}. gen twoboys = (sex_child1 == 1 & sex_child2 == 1)
{txt}
{com}. gen twogirls = (sex_child1 == 2 & sex_child2 == 2)
{txt}
{com}. gen twoboysgirls = (twoboys == 1 | twogirls == 1)
{txt}
{com}. gen samesex = (sex_child1 == sex_child2)
{txt}
{com}. gen twins = ((age_child2 == age_child3) & (us80a_birthqtr_child2 == us80a_birthqtr_child3)) 
{txt}
{com}. 
. * Create labor dummies - mothers
. gen labor_income_1995 = (us80a_incwage + us80a_incbus) * 2.099173554
{txt}
{com}. gen workedforpay = (us80a_wkswork1 > 0)
{txt}
{com}. gen us80a_ftotinc_1995 = us80a_ftotinc * 2.099173554
{txt}
{com}. gen ln_us80a_ftotinc_1995 = ln(max(us80a_ftotinc_1995,1))
{txt}
{com}. 
. replace us80a_uhrswork = 0 if workedforpay == 0
{txt}(0 real changes made)

{com}. // replace labor_income_1995 = 0 if workedforpay == 0
. 
. gen non_wifeincome = us80a_ftotinc_1995 - labor_income_1995 
{txt}
{com}. gen ln_non_wifeincome = ln(max(non_wifeincome,1))
{txt}
{com}. 
. * Create labor dummies - fathers
. gen labor_income_1995_father = (us80a_incwage_father + us80a_incbus_father)* 2.099173554
{txt}(57,457 missing values generated)

{com}. gen workedforpay_father = (us80a_wkswork1_father > 0)
{txt}
{com}. 
. replace us80a_uhrswork_father = 0 if workedforpay_father == 0
{txt}(0 real changes made)

{com}. // replace labor_income_1995_father = 0 if workedforpay_father == 0
. 
.   
. * Create race dummies
. gen white = (us80a_race == 1)
{txt}
{com}. gen hispanic = (us80a_race == 2)
{txt}
{com}. gen black = (us80a_race == 3)
{txt}
{com}. gen other_race = (us80a_race > 3)
{txt}
{com}. 
. save "Replication_data_motheronly.dta", replace
{txt}{p 0 4 2}
file {bf}
Replication_data_motheronly.dta{rm}
saved
{p_end}

{com}. 
.  
. * Table 2
. * 1) All Women
. estpost sum us80a_chborn_new morethantwo boyfirst boysecond twoboys twogirls samesex twins age age_firstbirth workedforpay us80a_wkswork1 us80a_uhrswork labor_income_1995 us80a_ftotinc_1995

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:e(count)}{space 1}{space 1}{ralign 9:e(sum_w)}{space 1}{space 1}{ralign 9:e(mean)}{space 1}{space 1}{ralign 9:e(Var)}{space 1}{space 1}{ralign 9:e(sd)}{space 1}{space 1}{ralign 9:e(min)}{space 1}{space 1}{ralign 9:e(max)}{space 1}{space 1}{ralign 9:e(sum)}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}
{space 0}{space 0}{ralign 12:us80a_chbo~w}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.551965}}}{space 1}{space 1}{ralign 9:{res:{sf: .6629937}}}{space 1}{space 1}{ralign 9:{res:{sf: .8142442}}}{space 1}{space 1}{ralign 9:{res:{sf:        2}}}{space 1}{space 1}{ralign 9:{res:{sf:        9}}}{space 1}{space 1}{ralign 9:{res:{sf:  1006906}}}{space 1}
{space 0}{space 0}{ralign 12:morethantwo}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf: .3989776}}}{space 1}{space 1}{ralign 9:{res:{sf: .2397951}}}{space 1}{space 1}{ralign 9:{res:{sf: .4896888}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:   157421}}}{space 1}
{space 0}{space 0}{ralign 12:boyfirst}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf: .5114444}}}{space 1}{space 1}{ralign 9:{res:{sf: .2498697}}}{space 1}{space 1}{ralign 9:{res:{sf: .4998696}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:   201796}}}{space 1}
{space 0}{space 0}{ralign 12:boysecond}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf: .5107981}}}{space 1}{space 1}{ralign 9:{res:{sf:  .249884}}}{space 1}{space 1}{ralign 9:{res:{sf:  .499884}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:   201541}}}{space 1}
{space 0}{space 0}{ralign 12:twoboys}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf: .2638832}}}{space 1}{space 1}{ralign 9:{res:{sf: .1942493}}}{space 1}{space 1}{ralign 9:{res:{sf: .4407373}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:   104118}}}{space 1}
{space 0}{space 0}{ralign 12:twogirls}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf: .2416407}}}{space 1}{space 1}{ralign 9:{res:{sf: .1832509}}}{space 1}{space 1}{ralign 9:{res:{sf: .4280782}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:    95342}}}{space 1}
{space 0}{space 0}{ralign 12:samesex}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf: .5055239}}}{space 1}{space 1}{ralign 9:{res:{sf: .2499701}}}{space 1}{space 1}{ralign 9:{res:{sf: .4999701}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:   199460}}}{space 1}
{space 0}{space 0}{ralign 12:twins}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf: .0086983}}}{space 1}{space 1}{ralign 9:{res:{sf: .0086226}}}{space 1}{space 1}{ralign 9:{res:{sf: .0928582}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     3432}}}{space 1}
{space 0}{space 0}{ralign 12:age}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf: 30.03404}}}{space 1}{space 1}{ralign 9:{res:{sf: 12.60407}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.550221}}}{space 1}{space 1}{ralign 9:{res:{sf:       21}}}{space 1}{space 1}{ralign 9:{res:{sf:       35}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.19e+07}}}{space 1}
{space 0}{space 0}{ralign 12:age_firstb~h}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf:  20.9914}}}{space 1}{space 1}{ralign 9:{res:{sf: 9.363934}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.060055}}}{space 1}{space 1}{ralign 9:{res:{sf:       10}}}{space 1}{space 1}{ralign 9:{res:{sf:       34}}}{space 1}{space 1}{ralign 9:{res:{sf:  8282386}}}{space 1}
{space 0}{space 0}{ralign 12:workedforpay}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf: .5620348}}}{space 1}{space 1}{ralign 9:{res:{sf: .2461523}}}{space 1}{space 1}{ralign 9:{res:{sf: .4961374}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:   221757}}}{space 1}
{space 0}{space 0}{ralign 12:us80a_wksw~1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf: 20.60136}}}{space 1}{space 1}{ralign 9:{res:{sf: 493.8568}}}{space 1}{space 1}{ralign 9:{res:{sf: 22.22289}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:       52}}}{space 1}{space 1}{ralign 9:{res:{sf:  8128495}}}{space 1}
{space 0}{space 0}{ralign 12:us80a_uhrs~k}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf: 18.65707}}}{space 1}{space 1}{ralign 9:{res:{sf: 357.3333}}}{space 1}{space 1}{ralign 9:{res:{sf: 18.90326}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:       99}}}{space 1}{space 1}{ralign 9:{res:{sf:  7361353}}}{space 1}
{space 0}{space 0}{ralign 12:labor_i~1995}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf: 7066.571}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.16e+08}}}{space 1}{space 1}{ralign 9:{res:{sf: 10761.87}}}{space 1}{space 1}{ralign 9:{res:{sf:-20981.24}}}{space 1}{space 1}{ralign 9:{res:{sf:   260308}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.79e+09}}}{space 1}
{space 0}{space 0}{ralign 12:us80a_f~1995}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf:   394561}}}{space 1}{space 1}{ralign 9:{res:{sf: 41924.53}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.98e+08}}}{space 1}{space 1}{ralign 9:{res:{sf: 26419.84}}}{space 1}{space 1}{ralign 9:{res:{sf:-20981.24}}}{space 1}{space 1}{ralign 9:{res:{sf:   157438}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.65e+10}}}{space 1}

{com}. esttab using Table2.csv, cells("mean sd") noobs label ti("All Women") replace
{res}{txt}(output written to {browse  `"Table2.csv"'})

{com}. 
. * 2) Married Women
. estpost sum us80a_chborn_new morethantwo boyfirst boysecond twoboys twogirls samesex twins age age_firstbirth workedforpay us80a_wkswork1 us80a_uhrswork labor_income_1995 us80a_ftotinc_1995 non_wifeincome if married == 1

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:e(count)}{space 1}{space 1}{ralign 9:e(sum_w)}{space 1}{space 1}{ralign 9:e(mean)}{space 1}{space 1}{ralign 9:e(Var)}{space 1}{space 1}{ralign 9:e(sd)}{space 1}{space 1}{ralign 9:e(min)}{space 1}{space 1}{ralign 9:e(max)}{space 1}{space 1}{ralign 9:e(sum)}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}
{space 0}{space 0}{ralign 12:us80a_chbo~w}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.494778}}}{space 1}{space 1}{ralign 9:{res:{sf: .5836899}}}{space 1}{space 1}{ralign 9:{res:{sf:  .763996}}}{space 1}{space 1}{ralign 9:{res:{sf:        2}}}{space 1}{space 1}{ralign 9:{res:{sf:        9}}}{space 1}{space 1}{ralign 9:{res:{sf:   627801}}}{space 1}
{space 0}{space 0}{ralign 12:morethantwo}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: .3705722}}}{space 1}{space 1}{ralign 9:{res:{sf: .2332494}}}{space 1}{space 1}{ralign 9:{res:{sf:  .482959}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:    93253}}}{space 1}
{space 0}{space 0}{ralign 12:boyfirst}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: .5146873}}}{space 1}{space 1}{ralign 9:{res:{sf: .2497853}}}{space 1}{space 1}{ralign 9:{res:{sf: .4997852}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:   129519}}}{space 1}
{space 0}{space 0}{ralign 12:boysecond}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: .5124977}}}{space 1}{space 1}{ralign 9:{res:{sf: .2498448}}}{space 1}{space 1}{ralign 9:{res:{sf: .4998448}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:   128968}}}{space 1}
{space 0}{space 0}{ralign 12:twoboys}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:  .266259}}}{space 1}{space 1}{ralign 9:{res:{sf: .1953659}}}{space 1}{space 1}{ralign 9:{res:{sf: .4420021}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:    67003}}}{space 1}
{space 0}{space 0}{ralign 12:twogirls}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: .2390739}}}{space 1}{space 1}{ralign 9:{res:{sf: .1819183}}}{space 1}{space 1}{ralign 9:{res:{sf: .4265188}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:    60162}}}{space 1}
{space 0}{space 0}{ralign 12:samesex}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: .5053329}}}{space 1}{space 1}{ralign 9:{res:{sf: .2499726}}}{space 1}{space 1}{ralign 9:{res:{sf: .4999726}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:   127165}}}{space 1}
{space 0}{space 0}{ralign 12:twins}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: .0084841}}}{space 1}{space 1}{ralign 9:{res:{sf: .0084122}}}{space 1}{space 1}{ralign 9:{res:{sf:  .091718}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:     2135}}}{space 1}
{space 0}{space 0}{ralign 12:age}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: 30.33302}}}{space 1}{space 1}{ralign 9:{res:{sf: 11.64701}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.412771}}}{space 1}{space 1}{ralign 9:{res:{sf:       21}}}{space 1}{space 1}{ralign 9:{res:{sf:       35}}}{space 1}{space 1}{ralign 9:{res:{sf:  7633183}}}{space 1}
{space 0}{space 0}{ralign 12:age_firstb~h}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: 21.80767}}}{space 1}{space 1}{ralign 9:{res:{sf: 8.660647}}}{space 1}{space 1}{ralign 9:{res:{sf: 2.942898}}}{space 1}{space 1}{ralign 9:{res:{sf:       13}}}{space 1}{space 1}{ralign 9:{res:{sf:       34}}}{space 1}{space 1}{ralign 9:{res:{sf:  5487813}}}{space 1}
{space 0}{space 0}{ralign 12:workedforpay}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: .5253253}}}{space 1}{space 1}{ralign 9:{res:{sf: .2493596}}}{space 1}{space 1}{ralign 9:{res:{sf: .4993592}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:   132196}}}{space 1}
{space 0}{space 0}{ralign 12:us80a_wksw~1}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: 18.80599}}}{space 1}{space 1}{ralign 9:{res:{sf: 474.8171}}}{space 1}{space 1}{ralign 9:{res:{sf:  21.7903}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:       52}}}{space 1}{space 1}{ralign 9:{res:{sf:  4732453}}}{space 1}
{space 0}{space 0}{ralign 12:us80a_uhrs~k}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: 16.58101}}}{space 1}{space 1}{ralign 9:{res:{sf: 335.3525}}}{space 1}{space 1}{ralign 9:{res:{sf: 18.31263}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:       99}}}{space 1}{space 1}{ralign 9:{res:{sf:  4172545}}}{space 1}
{space 0}{space 0}{ralign 12:labor_i~1995}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:  6170.23}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.04e+08}}}{space 1}{space 1}{ralign 9:{res:{sf: 10176.97}}}{space 1}{space 1}{ralign 9:{res:{sf:-20981.24}}}{space 1}{space 1}{ralign 9:{res:{sf:   260308}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.55e+09}}}{space 1}
{space 0}{space 0}{ralign 12:us80a_f~1995}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: 47468.76}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.63e+08}}}{space 1}{space 1}{ralign 9:{res:{sf:  25752.8}}}{space 1}{space 1}{ralign 9:{res:{sf:-20981.24}}}{space 1}{space 1}{ralign 9:{res:{sf:   157438}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.19e+10}}}{space 1}
{space 0}{space 0}{ralign 12:non_wifein~e}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: 41298.53}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.01e+08}}}{space 1}{space 1}{ralign 9:{res:{sf: 24516.09}}}{space 1}{space 1}{ralign 9:{res:{sf:  -102870}}}{space 1}{space 1}{ralign 9:{res:{sf: 178419.3}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.04e+10}}}{space 1}

{com}. esttab using Table2.csv, cells("mean sd") noobs label ti("Married Women") append
{res}{txt}(output written to {browse  `"Table2.csv"'})

{com}. 
. *3) Husbands
. estpost sum age_father age_firstbirth_father workedforpay_father us80a_wkswork1_father us80a_uhrswork_father labor_income_1995_father if married == 1

{txt}{space 0}{space 0}{ralign 12:}{space 1}{c |}{space 1}{ralign 9:e(count)}{space 1}{space 1}{ralign 9:e(sum_w)}{space 1}{space 1}{ralign 9:e(mean)}{space 1}{space 1}{ralign 9:e(Var)}{space 1}{space 1}{ralign 9:e(sd)}{space 1}{space 1}{ralign 9:e(min)}{space 1}{space 1}{ralign 9:e(max)}{space 1}{space 1}{ralign 9:e(sum)}{space 1}
{space 0}{hline 13}{c   +}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}{hline 11}
{space 0}{space 0}{ralign 12:age_father}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: 32.94218}}}{space 1}{space 1}{ralign 9:{res:{sf: 20.87399}}}{space 1}{space 1}{ralign 9:{res:{sf: 4.568806}}}{space 1}{space 1}{ralign 9:{res:{sf:       17}}}{space 1}{space 1}{ralign 9:{res:{sf:       82}}}{space 1}{space 1}{ralign 9:{res:{sf:  8289769}}}{space 1}
{space 0}{space 0}{ralign 12:age_firstb~r}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: 24.41684}}}{space 1}{space 1}{ralign 9:{res:{sf: 15.97781}}}{space 1}{space 1}{ralign 9:{res:{sf: 3.997226}}}{space 1}{space 1}{ralign 9:{res:{sf:       13}}}{space 1}{space 1}{ralign 9:{res:{sf:       76}}}{space 1}{space 1}{ralign 9:{res:{sf:  6144399}}}{space 1}
{space 0}{space 0}{ralign 12:workedforp~r}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: .9773611}}}{space 1}{space 1}{ralign 9:{res:{sf: .0221265}}}{space 1}{space 1}{ralign 9:{res:{sf: .1487498}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:        1}}}{space 1}{space 1}{ralign 9:{res:{sf:   245949}}}{space 1}
{space 0}{space 0}{ralign 12:us80a_wksw~r}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: 48.01447}}}{space 1}{space 1}{ralign 9:{res:{sf: 108.3197}}}{space 1}{space 1}{ralign 9:{res:{sf: 10.40767}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:       52}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.21e+07}}}{space 1}
{space 0}{space 0}{ralign 12:us80a_uhrs~r}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: 43.53195}}}{space 1}{space 1}{ralign 9:{res:{sf: 150.0706}}}{space 1}{space 1}{ralign 9:{res:{sf: 12.25033}}}{space 1}{space 1}{ralign 9:{res:{sf:        0}}}{space 1}{space 1}{ralign 9:{res:{sf:       99}}}{space 1}{space 1}{ralign 9:{res:{sf: 1.10e+07}}}{space 1}
{space 0}{space 0}{ralign 12:labor_inco~r}{space 1}{c |}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf:   251646}}}{space 1}{space 1}{ralign 9:{res:{sf: 38912.44}}}{space 1}{space 1}{ralign 9:{res:{sf: 6.27e+08}}}{space 1}{space 1}{ralign 9:{res:{sf:  25040.8}}}{space 1}{space 1}{ralign 9:{res:{sf:-20981.24}}}{space 1}{space 1}{ralign 9:{res:{sf:   314876}}}{space 1}{space 1}{ralign 9:{res:{sf: 9.79e+09}}}{space 1}

{com}. esttab using Table2.csv, cells("mean sd") noobs label ti("Married Women") append
{res}{txt}(output written to {browse  `"Table2.csv"'})

{com}. 
. 
. 
{txt}end of do-file

{com}. browse

. browse if married == 1

. do "/var/folders/yw/mp5v5fdx1_n4b01714b8bdl80000gn/T//SD40235.000000"
{txt}
{com}. 
. 
. * Table 6: 2SLS first stage
. // covariates: age, age_firstbirth, black, hispanic, other_race 
. reg morethantwo samesex

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   394,561
{txt}{hline 13}{c +}{hline 34}   F(1, 394559)    = {res}  1420.58
{txt}       Model {c |} {res} 339.425873         1  339.425873   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 94274.1217   394,559  .238935423   {txt}R-squared       ={res}    0.0036
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0036
{txt}       Total {c |} {res} 94613.5476   394,560  .239795082   {txt}Root MSE        =   {res} .48881

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} morethantwo{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}samesex {c |}{col 14}{res}{space 2}  .058664{col 26}{space 2} .0015565{col 37}{space 1}   37.69{col 46}{space 3}0.000{col 54}{space 4} .0556134{col 67}{space 3} .0617147
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .3693215{col 26}{space 2} .0011067{col 37}{space 1}  333.73{col 46}{space 3}0.000{col 54}{space 4} .3671525{col 67}{space 3} .3714905
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. outreg2 using table6.xls, keep(samesex) nocon ctitle(Column 1) replace
{txt}{browse `"table6.xls"'}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table6.txt""':seeout}

{com}. 
. reg morethantwo boyfirst boysecond samesex age age_firstbirth black hispanic other_race 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   394,561
{txt}{hline 13}{c +}{hline 34}   F(8, 394552)    = {res}  5192.42
{txt}       Model {c |} {res} 9012.29235         8  1126.53654   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 85601.2552   394,552  .216958107   {txt}R-squared       ={res}    0.0953
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0952
{txt}       Total {c |} {res} 94613.5476   394,560  .239795082   {txt}Root MSE        =   {res} .46579

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   morethantwo{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}boyfirst {c |}{col 16}{res}{space 2}-.0082591{col 28}{space 2} .0014839{col 39}{space 1}   -5.57{col 48}{space 3}0.000{col 56}{space 4}-.0111675{col 69}{space 3}-.0053507
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2}-.0083248{col 28}{space 2} .0014839{col 39}{space 1}   -5.61{col 48}{space 3}0.000{col 56}{space 4}-.0112333{col 69}{space 3}-.0054164
{txt}{space 7}samesex {c |}{col 16}{res}{space 2} .0600959{col 28}{space 2} .0014839{col 39}{space 1}   40.50{col 48}{space 3}0.000{col 56}{space 4} .0571875{col 69}{space 3} .0630043
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0319451{col 28}{space 2} .0002298{col 39}{space 1}  139.04{col 48}{space 3}0.000{col 56}{space 4} .0314948{col 69}{space 3} .0323954
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-.0464282{col 28}{space 2} .0002715{col 39}{space 1} -171.03{col 48}{space 3}0.000{col 56}{space 4}-.0469602{col 69}{space 3}-.0458961
{txt}{space 9}black {c |}{col 16}{res}{space 2} .0787682{col 28}{space 2} .0023512{col 39}{space 1}   33.50{col 48}{space 3}0.000{col 56}{space 4} .0741598{col 69}{space 3} .0833765
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} .1593407{col 28}{space 2} .0043381{col 39}{space 1}   36.73{col 48}{space 3}0.000{col 56}{space 4} .1508382{col 69}{space 3} .1678432
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} .0733209{col 28}{space 2} .0044609{col 39}{space 1}   16.44{col 48}{space 3}0.000{col 56}{space 4} .0645776{col 69}{space 3} .0820641
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .3758822{col 28}{space 2} .0071724{col 39}{space 1}   52.41{col 48}{space 3}0.000{col 56}{space 4} .3618245{col 69}{space 3} .3899398
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. outreg2 using table6.xls, keep(boyfirst boysecond samesex) nocon ctitle(Column 2) append
{txt}{browse `"table6.xls"'}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table6.txt""':seeout}

{com}. 
. reg morethantwo boyfirst twoboys twogirls age age_firstbirth black hispanic other_race 

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   394,561
{txt}{hline 13}{c +}{hline 34}   F(8, 394552)    = {res}  5192.42
{txt}       Model {c |} {res} 9012.29235         8  1126.53654   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 85601.2552   394,552  .216958107   {txt}R-squared       ={res}    0.0953
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0952
{txt}       Total {c |} {res} 94613.5476   394,560  .239795082   {txt}Root MSE        =   {res} .46579

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   morethantwo{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}boyfirst {c |}{col 16}{res}{space 2} .0000657{col 28}{space 2} .0021091{col 39}{space 1}    0.03{col 48}{space 3}0.975{col 56}{space 4} -.004068{col 69}{space 3} .0041994
{txt}{space 7}twoboys {c |}{col 16}{res}{space 2} .0517711{col 28}{space 2} .0020749{col 39}{space 1}   24.95{col 48}{space 3}0.000{col 56}{space 4} .0477044{col 69}{space 3} .0558378
{txt}{space 6}twogirls {c |}{col 16}{res}{space 2} .0684207{col 28}{space 2}  .002122{col 39}{space 1}   32.24{col 48}{space 3}0.000{col 56}{space 4} .0642617{col 69}{space 3} .0725797
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0319451{col 28}{space 2} .0002298{col 39}{space 1}  139.04{col 48}{space 3}0.000{col 56}{space 4} .0314948{col 69}{space 3} .0323954
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-.0464282{col 28}{space 2} .0002715{col 39}{space 1} -171.03{col 48}{space 3}0.000{col 56}{space 4}-.0469602{col 69}{space 3}-.0458961
{txt}{space 9}black {c |}{col 16}{res}{space 2} .0787682{col 28}{space 2} .0023512{col 39}{space 1}   33.50{col 48}{space 3}0.000{col 56}{space 4} .0741598{col 69}{space 3} .0833765
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} .1593407{col 28}{space 2} .0043381{col 39}{space 1}   36.73{col 48}{space 3}0.000{col 56}{space 4} .1508382{col 69}{space 3} .1678432
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} .0733209{col 28}{space 2} .0044609{col 39}{space 1}   16.44{col 48}{space 3}0.000{col 56}{space 4} .0645776{col 69}{space 3} .0820641
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .3675573{col 28}{space 2} .0071772{col 39}{space 1}   51.21{col 48}{space 3}0.000{col 56}{space 4} .3534903{col 69}{space 3} .3816243
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. outreg2 using table6.xls, keep(boyfirst twoboys twogirls) nocon ctitle(Column 3) append
{txt}{browse `"table6.xls"'}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table6.txt""':seeout}

{com}. 
. reg morethantwo samesex if married == 1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   251,646
{txt}{hline 13}{c +}{hline 34}   F(1, 251644)    = {res}  1226.12
{txt}       Model {c |} {res} 284.606535         1  284.606535   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 58411.4285   251,644  .232119297   {txt}R-squared       ={res}    0.0048
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0048
{txt}       Total {c |} {res}  58696.035   251,645  .233249359   {txt}Root MSE        =   {res} .48179

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1} morethantwo{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}samesex {c |}{col 14}{res}{space 2} .0672639{col 26}{space 2} .0019209{col 37}{space 1}   35.02{col 46}{space 3}0.000{col 54}{space 4} .0634989{col 67}{space 3} .0710289
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .3365815{col 26}{space 2} .0013655{col 37}{space 1}  246.48{col 46}{space 3}0.000{col 54}{space 4} .3339051{col 67}{space 3} .3392579
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. outreg2 using table6.xls, keep(samesex) nocon ctitle(Column 4) append
{txt}{browse `"table6.xls"'}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table6.txt""':seeout}

{com}. 
. reg morethantwo boyfirst boysecond samesex age age_firstbirth black hispanic other_race if married == 1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   251,646
{txt}{hline 13}{c +}{hline 34}   F(8, 251637)    = {res}  3051.96
{txt}       Model {c |} {res} 5191.41266         8  648.926582   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 53504.6224   251,637  .212626213   {txt}R-squared       ={res}    0.0884
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0884
{txt}       Total {c |} {res}  58696.035   251,645  .233249359   {txt}Root MSE        =   {res} .46111

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   morethantwo{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}boyfirst {c |}{col 16}{res}{space 2}-.0109898{col 28}{space 2} .0018399{col 39}{space 1}   -5.97{col 48}{space 3}0.000{col 56}{space 4}-.0145959{col 69}{space 3}-.0073838
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2} -.010572{col 28}{space 2} .0018399{col 39}{space 1}   -5.75{col 48}{space 3}0.000{col 56}{space 4}-.0141781{col 69}{space 3}-.0069659
{txt}{space 7}samesex {c |}{col 16}{res}{space 2} .0690307{col 28}{space 2} .0018399{col 39}{space 1}   37.52{col 48}{space 3}0.000{col 56}{space 4} .0654246{col 69}{space 3} .0726369
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0324063{col 28}{space 2} .0002939{col 39}{space 1}  110.27{col 48}{space 3}0.000{col 56}{space 4} .0318303{col 69}{space 3} .0329823
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-.0456183{col 28}{space 2} .0003418{col 39}{space 1} -133.48{col 48}{space 3}0.000{col 56}{space 4}-.0462881{col 69}{space 3}-.0449484
{txt}{space 9}black {c |}{col 16}{res}{space 2} .0620579{col 28}{space 2} .0042484{col 39}{space 1}   14.61{col 48}{space 3}0.000{col 56}{space 4} .0537311{col 69}{space 3} .0703847
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} .1664146{col 28}{space 2} .0058001{col 39}{space 1}   28.69{col 48}{space 3}0.000{col 56}{space 4} .1550466{col 69}{space 3} .1777826
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} .0607996{col 28}{space 2} .0054271{col 39}{space 1}   11.20{col 48}{space 3}0.000{col 56}{space 4} .0501627{col 69}{space 3} .0714365
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .3494032{col 28}{space 2} .0092824{col 39}{space 1}   37.64{col 48}{space 3}0.000{col 56}{space 4} .3312099{col 69}{space 3} .3675965
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. outreg2 using table6.xls, keep(boyfirst boysecond samesex) nocon ctitle(Column 5) append
{txt}{browse `"table6.xls"'}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table6.txt""':seeout}

{com}. 
. reg morethantwo boyfirst twoboys twogirls age age_firstbirth black hispanic other_race if married == 1

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   251,646
{txt}{hline 13}{c +}{hline 34}   F(8, 251637)    = {res}  3051.96
{txt}       Model {c |} {res} 5191.41266         8  648.926582   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 53504.6224   251,637  .212626213   {txt}R-squared       ={res}    0.0884
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0884
{txt}       Total {c |} {res}  58696.035   251,645  .233249359   {txt}Root MSE        =   {res} .46111

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   morethantwo{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}boyfirst {c |}{col 16}{res}{space 2}-.0004178{col 28}{space 2} .0026139{col 39}{space 1}   -0.16{col 48}{space 3}0.873{col 56}{space 4}-.0055411{col 69}{space 3} .0047054
{txt}{space 7}twoboys {c |}{col 16}{res}{space 2} .0584587{col 28}{space 2} .0025641{col 39}{space 1}   22.80{col 48}{space 3}0.000{col 56}{space 4} .0534331{col 69}{space 3} .0634844
{txt}{space 6}twogirls {c |}{col 16}{res}{space 2} .0796027{col 28}{space 2} .0026393{col 39}{space 1}   30.16{col 48}{space 3}0.000{col 56}{space 4} .0744299{col 69}{space 3} .0847756
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0324063{col 28}{space 2} .0002939{col 39}{space 1}  110.27{col 48}{space 3}0.000{col 56}{space 4} .0318303{col 69}{space 3} .0329823
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-.0456183{col 28}{space 2} .0003418{col 39}{space 1} -133.48{col 48}{space 3}0.000{col 56}{space 4}-.0462881{col 69}{space 3}-.0449484
{txt}{space 9}black {c |}{col 16}{res}{space 2} .0620579{col 28}{space 2} .0042484{col 39}{space 1}   14.61{col 48}{space 3}0.000{col 56}{space 4} .0537311{col 69}{space 3} .0703847
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} .1664146{col 28}{space 2} .0058001{col 39}{space 1}   28.69{col 48}{space 3}0.000{col 56}{space 4} .1550466{col 69}{space 3} .1777826
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} .0607996{col 28}{space 2} .0054271{col 39}{space 1}   11.20{col 48}{space 3}0.000{col 56}{space 4} .0501627{col 69}{space 3} .0714365
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .3388312{col 28}{space 2} .0092889{col 39}{space 1}   36.48{col 48}{space 3}0.000{col 56}{space 4} .3206252{col 69}{space 3} .3570372
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. outreg2 using table6.xls, keep(boyfirst twoboys twogirls) nocon ctitle(Column 6) append
{txt}{browse `"table6.xls"'}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table6.txt""':seeout}

{com}. 
. 
. 
. 
. * Table 7: IV Regressions
. * 1) All women
. 
. foreach var of varlist workedforpay us80a_wkswork1 us80a_uhrswork labor_income_1995 ln_us80a_ftotinc_1995 {c -(}
{txt}  2{com}.         reg `var' morethantwo age age_firstbirth boyfirst boysecond black hispanic other_race
{txt}  3{com}.         outreg2 using table7_allwomen, keep(morethantwo) nocon ctitle(All Women - OLS, `var')
{txt}  4{com}. {c )-}

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   394,561
{txt}{hline 13}{c +}{hline 34}   F(8, 394552)    = {res}  2762.20
{txt}       Model {c |} {res}  5150.9914         8  643.873925   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 91970.8646   394,552  .233102011   {txt}R-squared       ={res}    0.0530
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0530
{txt}       Total {c |} {res}  97121.856   394,560  .246152311   {txt}Root MSE        =   {res} .48281

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  workedforpay{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-.1751509{col 28}{space 2} .0016468{col 39}{space 1} -106.36{col 48}{space 3}0.000{col 56}{space 4}-.1783785{col 69}{space 3}-.1719233
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0246073{col 28}{space 2} .0002439{col 39}{space 1}  100.90{col 48}{space 3}0.000{col 56}{space 4} .0241293{col 69}{space 3} .0250853
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-.0285233{col 28}{space 2} .0002916{col 39}{space 1}  -97.83{col 48}{space 3}0.000{col 56}{space 4}-.0290947{col 69}{space 3}-.0279518
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-.0017846{col 28}{space 2} .0015378{col 39}{space 1}   -1.16{col 48}{space 3}0.246{col 56}{space 4}-.0047987{col 69}{space 3} .0012294
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2}-.0040352{col 28}{space 2} .0015378{col 39}{space 1}   -2.62{col 48}{space 3}0.009{col 56}{space 4}-.0070492{col 69}{space 3}-.0010211
{txt}{space 9}black {c |}{col 16}{res}{space 2} .1054135{col 28}{space 2} .0024406{col 39}{space 1}   43.19{col 48}{space 3}0.000{col 56}{space 4}   .10063{col 69}{space 3}  .110197
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-.0326719{col 28}{space 2} .0045042{col 39}{space 1}   -7.25{col 48}{space 3}0.000{col 56}{space 4}-.0415001{col 69}{space 3}-.0238438
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} .0422273{col 28}{space 2} .0046254{col 39}{space 1}    9.13{col 48}{space 3}0.000{col 56}{space 4} .0331616{col 69}{space 3}  .051293
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}    .4818{col 28}{space 2} .0074269{col 39}{space 1}   64.87{col 48}{space 3}0.000{col 56}{space 4} .4672434{col 69}{space 3} .4963565
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_allwomen.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}   394,561
{txt}{hline 13}{c +}{hline 34}   F(8, 394552)    = {res}  4181.74
{txt}       Model {c |} {res} 15230398.8         8  1903799.85   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  179625737   394,552  455.265054   {txt}R-squared       ={res}    0.0782
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0781
{txt}       Total {c |} {res}  194856136   394,560  493.856793   {txt}Root MSE        =   {res} 21.337

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}us80a_wkswork1{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-8.860877{col 28}{space 2} .0727765{col 39}{space 1} -121.75{col 48}{space 3}0.000{col 56}{space 4}-9.003516{col 69}{space 3}-8.718237
{txt}{space 11}age {c |}{col 16}{res}{space 2} 1.496934{col 28}{space 2} .0107777{col 39}{space 1}  138.89{col 48}{space 3}0.000{col 56}{space 4}  1.47581{col 69}{space 3} 1.518058
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-1.411953{col 28}{space 2} .0128853{col 39}{space 1} -109.58{col 48}{space 3}0.000{col 56}{space 4}-1.437208{col 69}{space 3}-1.386698
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-.1550502{col 28}{space 2} .0679611{col 39}{space 1}   -2.28{col 48}{space 3}0.023{col 56}{space 4} -.288252{col 69}{space 3}-.0218484
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2}-.1742188{col 28}{space 2} .0679609{col 39}{space 1}   -2.56{col 48}{space 3}0.010{col 56}{space 4}-.3074201{col 69}{space 3}-.0410175
{txt}{space 9}black {c |}{col 16}{res}{space 2} 6.368616{col 28}{space 2} .1078587{col 39}{space 1}   59.05{col 48}{space 3}0.000{col 56}{space 4} 6.157217{col 69}{space 3} 6.580016
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-.8987825{col 28}{space 2} .1990573{col 39}{space 1}   -4.52{col 48}{space 3}0.000{col 56}{space 4}-1.288929{col 69}{space 3}-.5086362
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}  2.80524{col 28}{space 2} .2044148{col 39}{space 1}   13.72{col 48}{space 3}0.000{col 56}{space 4} 2.404593{col 69}{space 3} 3.205887
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 8.172913{col 28}{space 2} .3282223{col 39}{space 1}   24.90{col 48}{space 3}0.000{col 56}{space 4} 7.529607{col 69}{space 3} 8.816219
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_allwomen.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}   394,561
{txt}{hline 13}{c +}{hline 34}   F(8, 394552)    = {res}  3430.75
{txt}       Model {c |} {res} 9169710.83         8  1146213.85   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  131819727   394,552  334.099756   {txt}R-squared       ={res}    0.0650
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0650
{txt}       Total {c |} {res}  140989438   394,560  357.333328   {txt}Root MSE        =   {res} 18.278

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}us80a_uhrswork{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-6.596676{col 28}{space 2} .0623444{col 39}{space 1} -105.81{col 48}{space 3}0.000{col 56}{space 4}-6.718869{col 69}{space 3}-6.474483
{txt}{space 11}age {c |}{col 16}{res}{space 2} .9151668{col 28}{space 2} .0092328{col 39}{space 1}   99.12{col 48}{space 3}0.000{col 56}{space 4} .8970708{col 69}{space 3} .9332628
{txt}age_firstbirth {c |}{col 16}{res}{space 2}  -1.3338{col 28}{space 2} .0110383{col 39}{space 1} -120.83{col 48}{space 3}0.000{col 56}{space 4}-1.355435{col 69}{space 3}-1.312165
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-.0885032{col 28}{space 2} .0582192{col 39}{space 1}   -1.52{col 48}{space 3}0.128{col 56}{space 4}-.2026111{col 69}{space 3} .0256048
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2}-.1310545{col 28}{space 2}  .058219{col 39}{space 1}   -2.25{col 48}{space 3}0.024{col 56}{space 4}-.2451621{col 69}{space 3}-.0169469
{txt}{space 9}black {c |}{col 16}{res}{space 2} 5.586044{col 28}{space 2} .0923977{col 39}{space 1}   60.46{col 48}{space 3}0.000{col 56}{space 4} 5.404948{col 69}{space 3} 5.767141
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} .5924529{col 28}{space 2} .1705234{col 39}{space 1}    3.47{col 48}{space 3}0.001{col 56}{space 4} .2582321{col 69}{space 3} .9266737
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} 3.923022{col 28}{space 2} .1751129{col 39}{space 1}   22.40{col 48}{space 3}0.000{col 56}{space 4} 3.579806{col 69}{space 3} 4.266238
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 21.11727{col 28}{space 2} .2811732{col 39}{space 1}   75.10{col 48}{space 3}0.000{col 56}{space 4} 20.56617{col 69}{space 3} 21.66836
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_allwomen.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}   394,561
{txt}{hline 13}{c +}{hline 34}   F(8, 394552)    = {res}  3355.51
{txt}       Model {c |} {res} 2.9110e+12         8  3.6388e+11   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 4.2786e+13   394,552   108442140   {txt}R-squared       ={res}    0.0637
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0637
{txt}       Total {c |} {res} 4.5697e+13   394,560   115817855   {txt}Root MSE        =   {res}  10414

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}labor_inc~1995{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-3729.217{col 28}{space 2} 35.51879{col 39}{space 1} -104.99{col 48}{space 3}0.000{col 56}{space 4}-3798.833{col 69}{space 3}-3659.602
{txt}{space 11}age {c |}{col 16}{res}{space 2} 648.5821{col 28}{space 2} 5.260094{col 39}{space 1}  123.30{col 48}{space 3}0.000{col 56}{space 4} 638.2724{col 69}{space 3} 658.8917
{txt}age_firstbirth {c |}{col 16}{res}{space 2} -434.585{col 28}{space 2}  6.28872{col 39}{space 1}  -69.11{col 48}{space 3}0.000{col 56}{space 4}-446.9107{col 69}{space 3}-422.2593
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-57.54494{col 28}{space 2} 33.16863{col 39}{space 1}   -1.73{col 48}{space 3}0.083{col 56}{space 4}-122.5545{col 69}{space 3} 7.464572
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2}-48.40783{col 28}{space 2} 33.16852{col 39}{space 1}   -1.46{col 48}{space 3}0.144{col 56}{space 4}-113.4171{col 69}{space 3} 16.60147
{txt}{space 9}black {c |}{col 16}{res}{space 2} 3896.987{col 28}{space 2} 52.64076{col 39}{space 1}   74.03{col 48}{space 3}0.000{col 56}{space 4} 3793.812{col 69}{space 3} 4000.161
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} 234.9789{col 28}{space 2} 97.15049{col 39}{space 1}    2.42{col 48}{space 3}0.016{col 56}{space 4} 44.56689{col 69}{space 3}  425.391
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} 2543.733{col 28}{space 2} 99.76523{col 39}{space 1}   25.50{col 48}{space 3}0.000{col 56}{space 4} 2348.196{col 69}{space 3}  2739.27
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-2292.814{col 28}{space 2} 160.1898{col 39}{space 1}  -14.31{col 48}{space 3}0.000{col 56}{space 4}-2606.782{col 69}{space 3}-1978.847
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_allwomen.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}   394,561
{txt}{hline 13}{c +}{hline 34}   F(8, 394552)    = {res}  3363.39
{txt}       Model {c |} {res} 47045.3632         8  5880.67039   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 689848.517   394,552  1.74843498   {txt}R-squared       ={res}    0.0638
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0638
{txt}       Total {c |} {res}  736893.88   394,560  1.86763453   {txt}Root MSE        =   {res} 1.3223

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}ln_us80a_~1995{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-.1343744{col 28}{space 2} .0045101{col 39}{space 1}  -29.79{col 48}{space 3}0.000{col 56}{space 4} -.143214{col 69}{space 3}-.1255348
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0488868{col 28}{space 2} .0006679{col 39}{space 1}   73.19{col 48}{space 3}0.000{col 56}{space 4} .0475777{col 69}{space 3} .0501959
{txt}age_firstbirth {c |}{col 16}{res}{space 2} .0298501{col 28}{space 2} .0007985{col 39}{space 1}   37.38{col 48}{space 3}0.000{col 56}{space 4}  .028285{col 69}{space 3} .0314152
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} .0063493{col 28}{space 2} .0042117{col 39}{space 1}    1.51{col 48}{space 3}0.132{col 56}{space 4}-.0019054{col 69}{space 3}  .014604
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2} .0050968{col 28}{space 2} .0042116{col 39}{space 1}    1.21{col 48}{space 3}0.226{col 56}{space 4}-.0031579{col 69}{space 3} .0133515
{txt}{space 9}black {c |}{col 16}{res}{space 2}-.6104892{col 28}{space 2} .0066842{col 39}{space 1}  -91.33{col 48}{space 3}0.000{col 56}{space 4}-.6235899{col 69}{space 3}-.5973884
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-.4848335{col 28}{space 2} .0123359{col 39}{space 1}  -39.30{col 48}{space 3}0.000{col 56}{space 4}-.5090114{col 69}{space 3}-.4606555
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}-.2218479{col 28}{space 2} .0126679{col 39}{space 1}  -17.51{col 48}{space 3}0.000{col 56}{space 4}-.2466766{col 69}{space 3}-.1970192
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 8.348556{col 28}{space 2} .0203405{col 39}{space 1}  410.44{col 48}{space 3}0.000{col 56}{space 4}  8.30869{col 69}{space 3} 8.388423
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_allwomen.txt""':seeout}

{com}. 
. foreach var of varlist workedforpay us80a_wkswork1 us80a_uhrswork labor_income_1995 ln_us80a_ftotinc_1995 {c -(}
{txt}  2{com}.         ivregress 2sls `var' (morethantwo = samesex) age age_firstbirth boyfirst boysecond black hispanic other_race, r
{txt}  3{com}.         outreg2 using table7_allwomen_iv, keep(morethantwo) nocon ctitle(All Women - IV(samesex), `var')
{txt}  4{com}.         {c )-}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}  11083.17
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0510
{txt}{col 51}Root MSE{col 67}=    {res} .48331

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}  workedforpay{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-.1275844{col 28}{space 2} .0256199{col 39}{space 1}   -4.98{col 48}{space 3}0.000{col 56}{space 4}-.1777984{col 69}{space 3}-.0773704
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0230892{col 28}{space 2} .0008513{col 39}{space 1}   27.12{col 48}{space 3}0.000{col 56}{space 4} .0214208{col 69}{space 3} .0247576
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-.0263166{col 28}{space 2}  .001221{col 39}{space 1}  -21.55{col 48}{space 3}0.000{col 56}{space 4}-.0287097{col 69}{space 3}-.0239235
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-.0014522{col 28}{space 2} .0015498{col 39}{space 1}   -0.94{col 48}{space 3}0.349{col 56}{space 4}-.0044897{col 69}{space 3} .0015853
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2}-.0037033{col 28}{space 2} .0015498{col 39}{space 1}   -2.39{col 48}{space 3}0.017{col 56}{space 4}-.0067408{col 69}{space 3}-.0006658
{txt}{space 9}black {c |}{col 16}{res}{space 2} .1016608{col 28}{space 2} .0031043{col 39}{space 1}   32.75{col 48}{space 3}0.000{col 56}{space 4} .0955765{col 69}{space 3}  .107745
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-.0402485{col 28}{space 2} .0061334{col 39}{space 1}   -6.56{col 48}{space 3}0.000{col 56}{space 4}-.0522697{col 69}{space 3}-.0282273
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} .0387524{col 28}{space 2} .0050156{col 39}{space 1}    7.73{col 48}{space 3}0.000{col 56}{space 4}  .028922{col 69}{space 3} .0485828
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .4625343{col 28}{space 2} .0127906{col 39}{space 1}   36.16{col 48}{space 3}0.000{col 56}{space 4} .4374652{col 69}{space 3} .4876033
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_allwomen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}  19112.56
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0750
{txt}{col 51}Root MSE{col 67}=    {res} 21.373

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}us80a_wkswork1{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-6.187455{col 28}{space 2} 1.133095{col 39}{space 1}   -5.46{col 48}{space 3}0.000{col 56}{space 4} -8.40828{col 69}{space 3} -3.96663
{txt}{space 11}age {c |}{col 16}{res}{space 2}  1.41161{col 28}{space 2} .0375815{col 39}{space 1}   37.56{col 48}{space 3}0.000{col 56}{space 4} 1.337951{col 69}{space 3} 1.485268
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-1.287929{col 28}{space 2} .0540233{col 39}{space 1}  -23.84{col 48}{space 3}0.000{col 56}{space 4}-1.393813{col 69}{space 3}-1.182045
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-.1363631{col 28}{space 2} .0685296{col 39}{space 1}   -1.99{col 48}{space 3}0.047{col 56}{space 4}-.2706785{col 69}{space 3}-.0020476
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2}-.1555674{col 28}{space 2}  .068535{col 39}{space 1}   -2.27{col 48}{space 3}0.023{col 56}{space 4}-.2898935{col 69}{space 3}-.0212413
{txt}{space 9}black {c |}{col 16}{res}{space 2} 6.157698{col 28}{space 2} .1422204{col 39}{space 1}   43.30{col 48}{space 3}0.000{col 56}{space 4} 5.878951{col 69}{space 3} 6.436445
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-1.324614{col 28}{space 2} .2644261{col 39}{space 1}   -5.01{col 48}{space 3}0.000{col 56}{space 4}-1.842879{col 69}{space 3} -.806348
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}  2.60994{col 28}{space 2} .2262558{col 39}{space 1}   11.54{col 48}{space 3}0.000{col 56}{space 4} 2.166487{col 69}{space 3} 3.053394
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 7.090105{col 28}{space 2} .5567593{col 39}{space 1}   12.73{col 48}{space 3}0.000{col 56}{space 4} 5.998877{col 69}{space 3} 8.181334
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_allwomen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}  16323.69
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0634
{txt}{col 51}Root MSE{col 67}=    {res} 18.294

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}us80a_uhrswork{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-4.957194{col 28}{space 2} .9698267{col 39}{space 1}   -5.11{col 48}{space 3}0.000{col 56}{space 4} -6.85802{col 69}{space 3}-3.056369
{txt}{space 11}age {c |}{col 16}{res}{space 2} .8628413{col 28}{space 2} .0322289{col 39}{space 1}   26.77{col 48}{space 3}0.000{col 56}{space 4} .7996738{col 69}{space 3} .9260088
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-1.257742{col 28}{space 2} .0461801{col 39}{space 1}  -27.24{col 48}{space 3}0.000{col 56}{space 4}-1.348253{col 69}{space 3}-1.167231
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-.0770432{col 28}{space 2} .0586448{col 39}{space 1}   -1.31{col 48}{space 3}0.189{col 56}{space 4}-.1919849{col 69}{space 3} .0378984
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2}-.1196165{col 28}{space 2} .0586855{col 39}{space 1}   -2.04{col 48}{space 3}0.042{col 56}{space 4} -.234638{col 69}{space 3} -.004595
{txt}{space 9}black {c |}{col 16}{res}{space 2} 5.456698{col 28}{space 2} .1223037{col 39}{space 1}   44.62{col 48}{space 3}0.000{col 56}{space 4} 5.216987{col 69}{space 3} 5.696409
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} .3313111{col 28}{space 2} .2374774{col 39}{space 1}    1.40{col 48}{space 3}0.163{col 56}{space 4} -.134136{col 69}{space 3} .7967582
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} 3.803254{col 28}{space 2} .2001304{col 39}{space 1}   19.00{col 48}{space 3}0.000{col 56}{space 4} 3.411006{col 69}{space 3} 4.195502
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 20.45323{col 28}{space 2} .4840585{col 39}{space 1}   42.25{col 48}{space 3}0.000{col 56}{space 4} 19.50449{col 69}{space 3} 21.40197
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_allwomen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}  15675.10
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0575
{txt}{col 51}Root MSE{col 67}=    {res}  10448

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}labor_inc~1995{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-1911.709{col 28}{space 2} 553.9026{col 39}{space 1}   -3.45{col 48}{space 3}0.001{col 56}{space 4}-2997.338{col 69}{space 3}-826.0795
{txt}{space 11}age {c |}{col 16}{res}{space 2} 590.5746{col 28}{space 2} 18.29454{col 39}{space 1}   32.28{col 48}{space 3}0.000{col 56}{space 4}  554.718{col 69}{space 3} 626.4313
{txt}age_firstbirth {c |}{col 16}{res}{space 2} -350.268{col 28}{space 2} 26.58106{col 39}{space 1}  -13.18{col 48}{space 3}0.000{col 56}{space 4}-402.3659{col 69}{space 3}-298.1701
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} -44.8406{col 28}{space 2} 33.50273{col 39}{space 1}   -1.34{col 48}{space 3}0.181{col 56}{space 4}-110.5047{col 69}{space 3} 20.82354
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2}-35.72779{col 28}{space 2} 33.46218{col 39}{space 1}   -1.07{col 48}{space 3}0.286{col 56}{space 4}-101.3125{col 69}{space 3} 29.85689
{txt}{space 9}black {c |}{col 16}{res}{space 2} 3753.595{col 28}{space 2} 72.43468{col 39}{space 1}   51.82{col 48}{space 3}0.000{col 56}{space 4} 3611.626{col 69}{space 3} 3895.564
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-54.51962{col 28}{space 2} 123.9159{col 39}{space 1}   -0.44{col 48}{space 3}0.660{col 56}{space 4}-297.3903{col 69}{space 3}  188.351
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}  2410.96{col 28}{space 2} 129.2147{col 39}{space 1}   18.66{col 48}{space 3}0.000{col 56}{space 4} 2157.704{col 69}{space 3} 2664.216
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-3028.954{col 28}{space 2} 273.5339{col 39}{space 1}  -11.07{col 48}{space 3}0.000{col 56}{space 4}-3565.071{col 69}{space 3}-2492.838
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_allwomen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}  18595.98
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0626
{txt}{col 51}Root MSE{col 67}=    {res} 1.3232

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}ln_us80a_~1995{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-.0303937{col 28}{space 2} .0701893{col 39}{space 1}   -0.43{col 48}{space 3}0.665{col 56}{space 4}-.1679622{col 69}{space 3} .1071749
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0455682{col 28}{space 2} .0023368{col 39}{space 1}   19.50{col 48}{space 3}0.000{col 56}{space 4}  .040988{col 69}{space 3} .0501483
{txt}age_firstbirth {c |}{col 16}{res}{space 2} .0346739{col 28}{space 2}  .003336{col 39}{space 1}   10.39{col 48}{space 3}0.000{col 56}{space 4} .0281354{col 69}{space 3} .0412124
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} .0070761{col 28}{space 2} .0042395{col 39}{space 1}    1.67{col 48}{space 3}0.095{col 56}{space 4}-.0012332{col 69}{space 3} .0153854
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2} .0058222{col 28}{space 2} .0042357{col 39}{space 1}    1.37{col 48}{space 3}0.169{col 56}{space 4}-.0024796{col 69}{space 3}  .014124
{txt}{space 9}black {c |}{col 16}{res}{space 2}-.6186927{col 28}{space 2} .0100761{col 39}{space 1}  -61.40{col 48}{space 3}0.000{col 56}{space 4}-.6384414{col 69}{space 3}-.5989439
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-.5013958{col 28}{space 2} .0193609{col 39}{space 1}  -25.90{col 48}{space 3}0.000{col 56}{space 4}-.5393426{col 69}{space 3}-.4634491
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}-.2294439{col 28}{space 2} .0163711{col 39}{space 1}  -14.02{col 48}{space 3}0.000{col 56}{space 4}-.2615306{col 69}{space 3}-.1973572
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 8.306441{col 28}{space 2} .0355286{col 39}{space 1}  233.80{col 48}{space 3}0.000{col 56}{space 4} 8.236807{col 69}{space 3} 8.376076
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_allwomen_iv.txt""':seeout}

{com}.         
. foreach var of varlist workedforpay us80a_wkswork1 us80a_uhrswork labor_income_1995 ln_us80a_ftotinc_1995 {c -(}
{txt}  2{com}.         ivregress 2sls `var' (morethantwo = twoboysgirls) age age_firstbirth boyfirst black hispanic other_race, r
{txt}  3{com}.         outreg2 using table7_allwomen_iv2, keep(morethantwo) nocon ctitle(All Women - IV(twoboysgirls), `var') 
{txt}  4{com}. {c )-}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}7{txt}){col 67}= {res}  11080.57
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0511
{txt}{col 51}Root MSE{col 67}=    {res} .48329

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}  workedforpay{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-.1289711{col 28}{space 2} .0256922{col 39}{space 1}   -5.02{col 48}{space 3}0.000{col 56}{space 4}-.1793269{col 69}{space 3}-.0786153
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0231336{col 28}{space 2} .0008535{col 39}{space 1}   27.11{col 48}{space 3}0.000{col 56}{space 4} .0214608{col 69}{space 3} .0248063
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-.0263831{col 28}{space 2} .0012244{col 39}{space 1}  -21.55{col 48}{space 3}0.000{col 56}{space 4}-.0287828{col 69}{space 3}-.0239834
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-.0015009{col 28}{space 2} .0015499{col 39}{space 1}   -0.97{col 48}{space 3}0.333{col 56}{space 4}-.0045387{col 69}{space 3} .0015369
{txt}{space 9}black {c |}{col 16}{res}{space 2} .1018107{col 28}{space 2} .0031091{col 39}{space 1}   32.75{col 48}{space 3}0.000{col 56}{space 4} .0957169{col 69}{space 3} .1079044
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-.0400328{col 28}{space 2} .0061406{col 39}{space 1}   -6.52{col 48}{space 3}0.000{col 56}{space 4}-.0520681{col 69}{space 3}-.0279975
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} .0388804{col 28}{space 2} .0050178{col 39}{space 1}    7.75{col 48}{space 3}0.000{col 56}{space 4} .0290457{col 69}{space 3}  .048715
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  .461256{col 28}{space 2}  .012719{col 39}{space 1}   36.27{col 48}{space 3}0.000{col 56}{space 4} .4363272{col 69}{space 3} .4861848
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_allwomen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}7{txt}){col 67}= {res}  19110.76
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0751
{txt}{col 51}Root MSE{col 67}=    {res} 21.372

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}us80a_wkswork1{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-6.245707{col 28}{space 2} 1.136261{col 39}{space 1}   -5.50{col 48}{space 3}0.000{col 56}{space 4}-8.472737{col 69}{space 3}-4.018678
{txt}{space 11}age {c |}{col 16}{res}{space 2} 1.413474{col 28}{space 2} .0376781{col 39}{space 1}   37.51{col 48}{space 3}0.000{col 56}{space 4} 1.339626{col 69}{space 3} 1.487322
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-1.290723{col 28}{space 2} .0541706{col 39}{space 1}  -23.83{col 48}{space 3}0.000{col 56}{space 4}-1.396895{col 69}{space 3}-1.184551
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} -.138412{col 28}{space 2} .0685298{col 39}{space 1}   -2.02{col 48}{space 3}0.043{col 56}{space 4} -.272728{col 69}{space 3} -.004096
{txt}{space 9}black {c |}{col 16}{res}{space 2} 6.163994{col 28}{space 2}  .142421{col 39}{space 1}   43.28{col 48}{space 3}0.000{col 56}{space 4} 5.884854{col 69}{space 3} 6.443134
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-1.315553{col 28}{space 2} .2647459{col 39}{space 1}   -4.97{col 48}{space 3}0.000{col 56}{space 4}-1.834445{col 69}{space 3}-.7966607
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} 2.615314{col 28}{space 2} .2263503{col 39}{space 1}   11.55{col 48}{space 3}0.000{col 56}{space 4} 2.171676{col 69}{space 3} 3.058953
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 7.036408{col 28}{space 2} .5535231{col 39}{space 1}   12.71{col 48}{space 3}0.000{col 56}{space 4} 5.951523{col 69}{space 3} 8.121294
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_allwomen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}7{txt}){col 67}= {res}  16322.43
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0635
{txt}{col 51}Root MSE{col 67}=    {res} 18.293

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}us80a_uhrswork{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-5.001985{col 28}{space 2} .9726332{col 39}{space 1}   -5.14{col 48}{space 3}0.000{col 56}{space 4}-6.908311{col 69}{space 3}-3.095659
{txt}{space 11}age {c |}{col 16}{res}{space 2} .8642748{col 28}{space 2} .0323146{col 39}{space 1}   26.75{col 48}{space 3}0.000{col 56}{space 4} .8009394{col 69}{space 3} .9276103
{txt}age_firstbirth {c |}{col 16}{res}{space 2} -1.25989{col 28}{space 2} .0463107{col 39}{space 1}  -27.21{col 48}{space 3}0.000{col 56}{space 4}-1.350658{col 69}{space 3}-1.169123
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-.0786187{col 28}{space 2}  .058647{col 39}{space 1}   -1.34{col 48}{space 3}0.180{col 56}{space 4}-.1935646{col 69}{space 3} .0363273
{txt}{space 9}black {c |}{col 16}{res}{space 2} 5.461539{col 28}{space 2}  .122483{col 39}{space 1}   44.59{col 48}{space 3}0.000{col 56}{space 4} 5.221477{col 69}{space 3} 5.701601
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} .3382778{col 28}{space 2} .2377537{col 39}{space 1}    1.42{col 48}{space 3}0.155{col 56}{space 4}-.1277109{col 69}{space 3} .8042665
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} 3.807386{col 28}{space 2} .2002091{col 39}{space 1}   19.02{col 48}{space 3}0.000{col 56}{space 4} 3.414984{col 69}{space 3} 4.199789
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 20.41194{col 28}{space 2} .4812959{col 39}{space 1}   42.41{col 48}{space 3}0.000{col 56}{space 4} 19.46862{col 69}{space 3} 21.35527
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_allwomen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}7{txt}){col 67}= {res}  15675.67
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0576
{txt}{col 51}Root MSE{col 67}=    {res}  10447

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}labor_inc~1995{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-1925.087{col 28}{space 2} 555.3643{col 39}{space 1}   -3.47{col 48}{space 3}0.001{col 56}{space 4}-3013.581{col 69}{space 3} -836.593
{txt}{space 11}age {c |}{col 16}{res}{space 2} 591.0028{col 28}{space 2} 18.33983{col 39}{space 1}   32.23{col 48}{space 3}0.000{col 56}{space 4} 555.0574{col 69}{space 3} 626.9482
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-350.9097{col 28}{space 2} 26.64911{col 39}{space 1}  -13.17{col 48}{space 3}0.000{col 56}{space 4} -403.141{col 69}{space 3}-298.6784
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-45.31117{col 28}{space 2} 33.50756{col 39}{space 1}   -1.35{col 48}{space 3}0.176{col 56}{space 4}-110.9848{col 69}{space 3} 20.36245
{txt}{space 9}black {c |}{col 16}{res}{space 2} 3755.041{col 28}{space 2} 72.54311{col 39}{space 1}   51.76{col 48}{space 3}0.000{col 56}{space 4} 3612.859{col 69}{space 3} 3897.223
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-52.43876{col 28}{space 2} 124.0773{col 39}{space 1}   -0.42{col 48}{space 3}0.673{col 56}{space 4}-295.6258{col 69}{space 3} 190.7483
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} 2412.194{col 28}{space 2} 129.2499{col 39}{space 1}   18.66{col 48}{space 3}0.000{col 56}{space 4} 2158.869{col 69}{space 3} 2665.519
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-3041.286{col 28}{space 2} 272.0422{col 39}{space 1}  -11.18{col 48}{space 3}0.000{col 56}{space 4}-3574.479{col 69}{space 3}-2508.093
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_allwomen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}7{txt}){col 67}= {res}  18590.18
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0625
{txt}{col 51}Root MSE{col 67}=    {res} 1.3232

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}ln_us80a_~1995{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-.0282135{col 28}{space 2} .0703659{col 39}{space 1}   -0.40{col 48}{space 3}0.688{col 56}{space 4}-.1661281{col 69}{space 3} .1097011
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0454984{col 28}{space 2} .0023423{col 39}{space 1}   19.42{col 48}{space 3}0.000{col 56}{space 4} .0409076{col 69}{space 3} .0500892
{txt}age_firstbirth {c |}{col 16}{res}{space 2} .0347785{col 28}{space 2} .0033441{col 39}{space 1}   10.40{col 48}{space 3}0.000{col 56}{space 4} .0282241{col 69}{space 3} .0413328
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} .0071528{col 28}{space 2} .0042397{col 39}{space 1}    1.69{col 48}{space 3}0.092{col 56}{space 4}-.0011569{col 69}{space 3} .0154625
{txt}{space 9}black {c |}{col 16}{res}{space 2}-.6189283{col 28}{space 2} .0100866{col 39}{space 1}  -61.36{col 48}{space 3}0.000{col 56}{space 4}-.6386977{col 69}{space 3}-.5991589
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-.5017349{col 28}{space 2} .0193789{col 39}{space 1}  -25.89{col 48}{space 3}0.000{col 56}{space 4}-.5397169{col 69}{space 3} -.463753
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} -.229645{col 28}{space 2} .0163775{col 39}{space 1}  -14.02{col 48}{space 3}0.000{col 56}{space 4}-.2617443{col 69}{space 3}-.1975458
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 8.308451{col 28}{space 2} .0353671{col 39}{space 1}  234.92{col 48}{space 3}0.000{col 56}{space 4} 8.239133{col 69}{space 3} 8.377769
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_allwomen_iv2.txt""':seeout}

{com}. 
. * 2) Married Women
. 
. foreach var of varlist workedforpay us80a_wkswork1 us80a_uhrswork labor_income_1995 ln_us80a_ftotinc_1995 ln_non_wifeincome {c -(}
{txt}  2{com}.         reg `var' morethantwo age age_firstbirth boyfirst boysecond black hispanic other_race if married == 1
{txt}  3{com}.         outreg2 using table7_marriedwomen, keep(morethantwo) nocon ctitle(Married Women - OLS, `var')
{txt}  4{com}. {c )-}

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   251,646
{txt}{hline 13}{c +}{hline 34}   F(8, 251637)    = {res}  1629.64
{txt}       Model {c |} {res} 3090.89796         8  386.362245   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 59659.2042   251,637  .237084388   {txt}R-squared       ={res}    0.0493
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0492
{txt}       Total {c |} {res} 62750.1021   251,645  .249359622   {txt}Root MSE        =   {res} .48691

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}  workedforpay{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-.1651307{col 28}{space 2} .0020992{col 39}{space 1}  -78.67{col 48}{space 3}0.000{col 56}{space 4} -.169245{col 69}{space 3}-.1610164
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0236206{col 28}{space 2} .0003177{col 39}{space 1}   74.36{col 48}{space 3}0.000{col 56}{space 4}  .022998{col 69}{space 3} .0242432
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-.0286641{col 28}{space 2} .0003733{col 39}{space 1}  -76.78{col 48}{space 3}0.000{col 56}{space 4}-.0293958{col 69}{space 3}-.0279323
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-.0000551{col 28}{space 2} .0019423{col 39}{space 1}   -0.03{col 48}{space 3}0.977{col 56}{space 4} -.003862{col 69}{space 3} .0037518
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2}-.0042276{col 28}{space 2} .0019421{col 39}{space 1}   -2.18{col 48}{space 3}0.029{col 56}{space 4} -.008034{col 69}{space 3}-.0004211
{txt}{space 9}black {c |}{col 16}{res}{space 2} .1945997{col 28}{space 2}  .004488{col 39}{space 1}   43.36{col 48}{space 3}0.000{col 56}{space 4} .1858034{col 69}{space 3}  .203396
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} .0206356{col 28}{space 2} .0061345{col 39}{space 1}    3.36{col 48}{space 3}0.001{col 56}{space 4}  .008612{col 69}{space 3} .0326591
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} .0587646{col 28}{space 2} .0057321{col 39}{space 1}   10.25{col 48}{space 3}0.000{col 56}{space 4} .0475299{col 69}{space 3} .0699993
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .4853911{col 28}{space 2} .0097909{col 39}{space 1}   49.58{col 48}{space 3}0.000{col 56}{space 4} .4662011{col 69}{space 3}  .504581
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedwomen.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}   251,646
{txt}{hline 13}{c +}{hline 34}   F(8, 251637)    = {res}  2354.50
{txt}       Model {c |} {res} 8321074.51         8  1040134.31   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  111164287   251,637  441.764474   {txt}R-squared       ={res}    0.0696
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0696
{txt}       Total {c |} {res}  119485361   251,645  474.817149   {txt}Root MSE        =   {res} 21.018

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}us80a_wkswork1{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2} -7.90178{col 28}{space 2} .0906126{col 39}{space 1}  -87.20{col 48}{space 3}0.000{col 56}{space 4}-8.079378{col 69}{space 3}-7.724181
{txt}{space 11}age {c |}{col 16}{res}{space 2} 1.360785{col 28}{space 2} .0137124{col 39}{space 1}   99.24{col 48}{space 3}0.000{col 56}{space 4} 1.333909{col 69}{space 3} 1.387661
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-1.378445{col 28}{space 2}  .016116{col 39}{space 1}  -85.53{col 48}{space 3}0.000{col 56}{space 4}-1.410032{col 69}{space 3}-1.346858
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-.0659731{col 28}{space 2} .0838427{col 39}{space 1}   -0.79{col 48}{space 3}0.431{col 56}{space 4}-.2303026{col 69}{space 3} .0983564
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2} -.130491{col 28}{space 2} .0838323{col 39}{space 1}   -1.56{col 48}{space 3}0.120{col 56}{space 4}-.2948001{col 69}{space 3} .0338181
{txt}{space 9}black {c |}{col 16}{res}{space 2}  10.8026{col 28}{space 2} .1937292{col 39}{space 1}   55.76{col 48}{space 3}0.000{col 56}{space 4} 10.42289{col 69}{space 3}  11.1823
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} 1.166074{col 28}{space 2} .2648052{col 39}{space 1}    4.40{col 48}{space 3}0.000{col 56}{space 4} .6470626{col 69}{space 3} 1.685085
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} 4.042111{col 28}{space 2}  .247432{col 39}{space 1}   16.34{col 48}{space 3}0.000{col 56}{space 4} 3.557151{col 69}{space 3} 4.527071
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  9.93273{col 28}{space 2} .4226366{col 39}{space 1}   23.50{col 48}{space 3}0.000{col 56}{space 4} 9.104374{col 69}{space 3} 10.76109
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedwomen.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}   251,646
{txt}{hline 13}{c +}{hline 34}   F(8, 251637)    = {res}  2128.66
{txt}       Model {c |} {res} 5349002.65         8  668625.332   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 79040769.4   251,637  314.106309   {txt}R-squared       ={res}    0.0634
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0634
{txt}       Total {c |} {res}   84389772   251,645  335.352469   {txt}Root MSE        =   {res} 17.723

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}us80a_uhrswork{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-5.932208{col 28}{space 2} .0764067{col 39}{space 1}  -77.64{col 48}{space 3}0.000{col 56}{space 4}-6.081963{col 69}{space 3}-5.782453
{txt}{space 11}age {c |}{col 16}{res}{space 2} .8228789{col 28}{space 2} .0115627{col 39}{space 1}   71.17{col 48}{space 3}0.000{col 56}{space 4} .8002163{col 69}{space 3} .8455414
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-1.304678{col 28}{space 2} .0135894{col 39}{space 1}  -96.01{col 48}{space 3}0.000{col 56}{space 4}-1.331313{col 69}{space 3}-1.278043
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} .0354913{col 28}{space 2} .0706982{col 39}{space 1}    0.50{col 48}{space 3}0.616{col 56}{space 4}-.1030753{col 69}{space 3} .1740579
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2}-.1119685{col 28}{space 2} .0706894{col 39}{space 1}   -1.58{col 48}{space 3}0.113{col 56}{space 4}-.2505179{col 69}{space 3} .0265809
{txt}{space 9}black {c |}{col 16}{res}{space 2} 9.775756{col 28}{space 2} .1633571{col 39}{space 1}   59.84{col 48}{space 3}0.000{col 56}{space 4} 9.455581{col 69}{space 3} 10.09593
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} 2.907698{col 28}{space 2} .2232901{col 39}{space 1}   13.02{col 48}{space 3}0.000{col 56}{space 4} 2.470056{col 69}{space 3} 3.345341
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} 5.079134{col 28}{space 2} .2086406{col 39}{space 1}   24.34{col 48}{space 3}0.000{col 56}{space 4} 4.670203{col 69}{space 3} 5.488064
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 21.59866{col 28}{space 2} .3563773{col 39}{space 1}   60.61{col 48}{space 3}0.000{col 56}{space 4} 20.90017{col 69}{space 3} 22.29715
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedwomen.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}   251,646
{txt}{hline 13}{c +}{hline 34}   F(8, 251637)    = {res}  1864.84
{txt}       Model {c |} {res} 1.4587e+12         8  1.8234e+11   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 2.4604e+13   251,637  97777240.7   {txt}R-squared       ={res}    0.0560
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0559
{txt}       Total {c |} {res} 2.6063e+13   251,645   103570820   {txt}Root MSE        =   {res} 9888.2

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}labor_inc~1995{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-3118.194{col 28}{space 2} 42.62966{col 39}{space 1}  -73.15{col 48}{space 3}0.000{col 56}{space 4}-3201.747{col 69}{space 3}-3034.641
{txt}{space 11}age {c |}{col 16}{res}{space 2} 533.7988{col 28}{space 2}  6.45117{col 39}{space 1}   82.74{col 48}{space 3}0.000{col 56}{space 4} 521.1547{col 69}{space 3} 546.4429
{txt}age_firstbirth {c |}{col 16}{res}{space 2} -345.041{col 28}{space 2}  7.58195{col 39}{space 1}  -45.51{col 48}{space 3}0.000{col 56}{space 4}-359.9015{col 69}{space 3}-330.1806
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} 1.954155{col 28}{space 2} 39.44472{col 39}{space 1}    0.05{col 48}{space 3}0.960{col 56}{space 4}-75.35644{col 69}{space 3} 79.26475
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2} 4.384928{col 28}{space 2} 39.43983{col 39}{space 1}    0.11{col 48}{space 3}0.911{col 56}{space 4}-72.91608{col 69}{space 3} 81.68594
{txt}{space 9}black {c |}{col 16}{res}{space 2} 6171.496{col 28}{space 2} 91.14202{col 39}{space 1}   67.71{col 48}{space 3}0.000{col 56}{space 4}  5992.86{col 69}{space 3} 6350.132
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} 1089.547{col 28}{space 2} 124.5805{col 39}{space 1}    8.75{col 48}{space 3}0.000{col 56}{space 4} 845.3727{col 69}{space 3} 1333.722
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} 3336.566{col 28}{space 2} 116.4071{col 39}{space 1}   28.66{col 48}{space 3}0.000{col 56}{space 4} 3108.411{col 69}{space 3}  3564.72
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-1778.274{col 28}{space 2}  198.834{col 39}{space 1}   -8.94{col 48}{space 3}0.000{col 56}{space 4}-2167.984{col 69}{space 3}-1388.565
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedwomen.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}   251,646
{txt}{hline 13}{c +}{hline 34}   F(8, 251637)    = {res}  1231.48
{txt}       Model {c |} {res}  10425.143         8  1303.14287   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 266279.927   251,637  1.05819068   {txt}R-squared       ={res}    0.0377
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0376
{txt}       Total {c |} {res}  276705.07   251,645  1.09958501   {txt}Root MSE        =   {res} 1.0287

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}ln_us80a_~1995{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-.1371417{col 28}{space 2} .0044348{col 39}{space 1}  -30.92{col 48}{space 3}0.000{col 56}{space 4}-.1458338{col 69}{space 3}-.1284496
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0435541{col 28}{space 2} .0006711{col 39}{space 1}   64.90{col 48}{space 3}0.000{col 56}{space 4} .0422387{col 69}{space 3} .0448695
{txt}age_firstbirth {c |}{col 16}{res}{space 2} .0187684{col 28}{space 2} .0007888{col 39}{space 1}   23.79{col 48}{space 3}0.000{col 56}{space 4} .0172224{col 69}{space 3} .0203143
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} .0077928{col 28}{space 2} .0041035{col 39}{space 1}    1.90{col 48}{space 3}0.058{col 56}{space 4}-.0002499{col 69}{space 3} .0158356
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2} .0009699{col 28}{space 2}  .004103{col 39}{space 1}    0.24{col 48}{space 3}0.813{col 56}{space 4}-.0070718{col 69}{space 3} .0090116
{txt}{space 9}black {c |}{col 16}{res}{space 2}-.1439357{col 28}{space 2} .0094816{col 39}{space 1}  -15.18{col 48}{space 3}0.000{col 56}{space 4}-.1625193{col 69}{space 3} -.125352
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-.3199981{col 28}{space 2} .0129602{col 39}{space 1}  -24.69{col 48}{space 3}0.000{col 56}{space 4}-.3453999{col 69}{space 3}-.2945964
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}-.1898945{col 28}{space 2}   .01211{col 39}{space 1}  -15.68{col 48}{space 3}0.000{col 56}{space 4}-.2136297{col 69}{space 3}-.1661593
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 8.891225{col 28}{space 2} .0206849{col 39}{space 1}  429.84{col 48}{space 3}0.000{col 56}{space 4} 8.850683{col 69}{space 3} 8.931767
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedwomen.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}   251,646
{txt}{hline 13}{c +}{hline 34}   F(8, 251637)    = {res}   997.83
{txt}       Model {c |} {res} 12197.1799         8  1524.64748   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 384490.382   251,637  1.52795647   {txt}R-squared       ={res}    0.0307
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0307
{txt}       Total {c |} {res} 396687.562   251,645  1.57637768   {txt}Root MSE        =   {res} 1.2361

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}ln_non_wifei~e{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-.0593514{col 28}{space 2}  .005329{col 39}{space 1}  -11.14{col 48}{space 3}0.000{col 56}{space 4}-.0697961{col 69}{space 3}-.0489066
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0322764{col 28}{space 2} .0008064{col 39}{space 1}   40.02{col 48}{space 3}0.000{col 56}{space 4} .0306958{col 69}{space 3}  .033857
{txt}age_firstbirth {c |}{col 16}{res}{space 2} .0339676{col 28}{space 2} .0009478{col 39}{space 1}   35.84{col 48}{space 3}0.000{col 56}{space 4} .0321099{col 69}{space 3} .0358253
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} .0079149{col 28}{space 2} .0049309{col 39}{space 1}    1.61{col 48}{space 3}0.108{col 56}{space 4}-.0017495{col 69}{space 3} .0175793
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2} .0064095{col 28}{space 2} .0049303{col 39}{space 1}    1.30{col 48}{space 3}0.194{col 56}{space 4}-.0032537{col 69}{space 3} .0160727
{txt}{space 9}black {c |}{col 16}{res}{space 2}-.4062491{col 28}{space 2} .0113935{col 39}{space 1}  -35.66{col 48}{space 3}0.000{col 56}{space 4}  -.42858{col 69}{space 3}-.3839183
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-.4019294{col 28}{space 2} .0155735{col 39}{space 1}  -25.81{col 48}{space 3}0.000{col 56}{space 4}-.4324531{col 69}{space 3}-.3714057
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}-.3023136{col 28}{space 2} .0145518{col 39}{space 1}  -20.78{col 48}{space 3}0.000{col 56}{space 4}-.3308346{col 69}{space 3}-.2737925
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 8.688844{col 28}{space 2} .0248558{col 39}{space 1}  349.57{col 48}{space 3}0.000{col 56}{space 4} 8.640127{col 69}{space 3} 8.737561
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedwomen.txt""':seeout}

{com}. 
. foreach var of varlist workedforpay us80a_wkswork1 us80a_uhrswork labor_income_1995 ln_us80a_ftotinc_1995 ln_non_wifeincome {c -(}
{txt}  2{com}.         ivregress 2sls `var' (morethantwo = samesex) age age_firstbirth boyfirst boysecond black hispanic other_race if married == 1, r
{txt}  3{com}.         outreg2 using table7_marriedwomen_iv, keep(morethantwo) nocon ctitle(Married Women - IV(samesex), `var')
{txt}  4{com}.         {c )-}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}   7277.82
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0479
{txt}{col 51}Root MSE{col 67}=    {res} .48725

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}  workedforpay{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-.1252201{col 28}{space 2}  .028165{col 39}{space 1}   -4.45{col 48}{space 3}0.000{col 56}{space 4}-.1804226{col 69}{space 3}-.0700176
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0223285{col 28}{space 2} .0009626{col 39}{space 1}   23.20{col 48}{space 3}0.000{col 56}{space 4} .0204419{col 69}{space 3} .0242151
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-.0268454{col 28}{space 2} .0013324{col 39}{space 1}  -20.15{col 48}{space 3}0.000{col 56}{space 4}-.0294568{col 69}{space 3} -.024234
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} .0003162{col 28}{space 2}  .001961{col 39}{space 1}    0.16{col 48}{space 3}0.872{col 56}{space 4}-.0035272{col 69}{space 3} .0041597
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2}-.0038852{col 28}{space 2} .0019582{col 39}{space 1}   -1.98{col 48}{space 3}0.047{col 56}{space 4}-.0077232{col 69}{space 3}-.0000472
{txt}{space 9}black {c |}{col 16}{res}{space 2} .1921427{col 28}{space 2} .0044978{col 39}{space 1}   42.72{col 48}{space 3}0.000{col 56}{space 4} .1833273{col 69}{space 3} .2009582
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} .0139879{col 28}{space 2} .0077497{col 39}{space 1}    1.80{col 48}{space 3}0.071{col 56}{space 4}-.0012012{col 69}{space 3}  .029177
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} .0563609{col 28}{space 2} .0060185{col 39}{space 1}    9.36{col 48}{space 3}0.000{col 56}{space 4} .0445649{col 69}{space 3} .0681569
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .4701336{col 28}{space 2} .0145804{col 39}{space 1}   32.24{col 48}{space 3}0.000{col 56}{space 4} .4415565{col 69}{space 3} .4987107
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedwomen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}  11277.71
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0674
{txt}{col 51}Root MSE{col 67}=    {res} 21.043

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}us80a_wkswork1{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-5.673721{col 28}{space 2} 1.216412{col 39}{space 1}   -4.66{col 48}{space 3}0.000{col 56}{space 4}-8.057846{col 69}{space 3}-3.289597
{txt}{space 11}age {c |}{col 16}{res}{space 2}  1.28865{col 28}{space 2} .0415128{col 39}{space 1}   31.04{col 48}{space 3}0.000{col 56}{space 4} 1.207287{col 69}{space 3} 1.370014
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-1.276915{col 28}{space 2} .0576024{col 39}{space 1}  -22.17{col 48}{space 3}0.000{col 56}{space 4}-1.389813{col 69}{space 3}-1.164016
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-.0452437{col 28}{space 2} .0846918{col 39}{space 1}   -0.53{col 48}{space 3}0.593{col 56}{space 4}-.2112366{col 69}{space 3} .1207491
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2}-.1113754{col 28}{space 2} .0845814{col 39}{space 1}   -1.32{col 48}{space 3}0.188{col 56}{space 4} -.277152{col 69}{space 3} .0544011
{txt}{space 9}black {c |}{col 16}{res}{space 2} 10.66543{col 28}{space 2} .2139719{col 39}{space 1}   49.85{col 48}{space 3}0.000{col 56}{space 4} 10.24606{col 69}{space 3} 11.08481
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} .7949583{col 28}{space 2} .3292847{col 39}{space 1}    2.41{col 48}{space 3}0.016{col 56}{space 4} .1495721{col 69}{space 3} 1.440344
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}  3.90792{col 28}{space 2} .2717167{col 39}{space 1}   14.38{col 48}{space 3}0.000{col 56}{space 4} 3.375365{col 69}{space 3} 4.440475
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 9.080963{col 28}{space 2} .6160631{col 39}{space 1}   14.74{col 48}{space 3}0.000{col 56}{space 4} 7.873502{col 69}{space 3} 10.28842
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedwomen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}  10924.71
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0629
{txt}{col 51}Root MSE{col 67}=    {res} 17.727

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}us80a_uhrswork{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-5.043726{col 28}{space 2} 1.024709{col 39}{space 1}   -4.92{col 48}{space 3}0.000{col 56}{space 4} -7.05212{col 69}{space 3}-3.035333
{txt}{space 11}age {c |}{col 16}{res}{space 2} .7941138{col 28}{space 2} .0350519{col 39}{space 1}   22.66{col 48}{space 3}0.000{col 56}{space 4} .7254134{col 69}{space 3} .8628142
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-1.264191{col 28}{space 2} .0484592{col 39}{space 1}  -26.09{col 48}{space 3}0.000{col 56}{space 4}-1.359169{col 69}{space 3}-1.169213
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} .0437575{col 28}{space 2} .0713301{col 39}{space 1}    0.61{col 48}{space 3}0.540{col 56}{space 4} -.096047{col 69}{space 3}  .183562
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2}-.1043458{col 28}{space 2} .0712915{col 39}{space 1}   -1.46{col 48}{space 3}0.143{col 56}{space 4}-.2440746{col 69}{space 3}  .035383
{txt}{space 9}black {c |}{col 16}{res}{space 2} 9.721059{col 28}{space 2} .1801416{col 39}{space 1}   53.96{col 48}{space 3}0.000{col 56}{space 4} 9.367988{col 69}{space 3} 10.07413
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} 2.759709{col 28}{space 2} .2955745{col 39}{space 1}    9.34{col 48}{space 3}0.000{col 56}{space 4} 2.180393{col 69}{space 3} 3.339024
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} 5.025622{col 28}{space 2}  .238482{col 39}{space 1}   21.07{col 48}{space 3}0.000{col 56}{space 4} 4.558206{col 69}{space 3} 5.493038
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}   21.259{col 28}{space 2} .5319719{col 39}{space 1}   39.96{col 48}{space 3}0.000{col 56}{space 4} 20.21636{col 69}{space 3} 22.30165
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedwomen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}   8338.03
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0495
{txt}{col 51}Root MSE{col 67}=    {res} 9921.7

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}labor_inc~1995{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-1353.209{col 28}{space 2} 573.3616{col 39}{space 1}   -2.36{col 48}{space 3}0.018{col 56}{space 4}-2476.977{col 69}{space 3}-229.4409
{txt}{space 11}age {c |}{col 16}{res}{space 2} 476.6564{col 28}{space 2} 19.47318{col 39}{space 1}   24.48{col 48}{space 3}0.000{col 56}{space 4} 438.4897{col 69}{space 3} 514.8232
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-264.6126{col 28}{space 2} 27.33072{col 39}{space 1}   -9.68{col 48}{space 3}0.000{col 56}{space 4}-318.1798{col 69}{space 3}-211.0454
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} 18.37518{col 28}{space 2} 40.00178{col 39}{space 1}    0.46{col 48}{space 3}0.646{col 56}{space 4}-60.02687{col 69}{space 3} 96.77722
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2} 19.52757{col 28}{space 2} 39.81825{col 39}{space 1}    0.49{col 48}{space 3}0.624{col 56}{space 4}-58.51477{col 69}{space 3} 97.56992
{txt}{space 9}black {c |}{col 16}{res}{space 2} 6062.839{col 28}{space 2} 116.6555{col 39}{space 1}   51.97{col 48}{space 3}0.000{col 56}{space 4} 5834.199{col 69}{space 3}  6291.48
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} 795.5632{col 28}{space 2} 155.5473{col 39}{space 1}    5.11{col 48}{space 3}0.000{col 56}{space 4} 490.6961{col 69}{space 3}  1100.43
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} 3230.265{col 28}{space 2} 158.7391{col 39}{space 1}   20.35{col 48}{space 3}0.000{col 56}{space 4} 2919.142{col 69}{space 3} 3541.388
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-2453.012{col 28}{space 2}  290.597{col 39}{space 1}   -8.44{col 48}{space 3}0.000{col 56}{space 4}-3022.572{col 69}{space 3}-1883.453
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedwomen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}   7682.56
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0362
{txt}{col 51}Root MSE{col 67}=    {res} 1.0295

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}ln_us80a_~1995{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-.0492494{col 28}{space 2} .0595908{col 39}{space 1}   -0.83{col 48}{space 3}0.409{col 56}{space 4}-.1660452{col 69}{space 3} .0675464
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0407085{col 28}{space 2} .0020549{col 39}{space 1}   19.81{col 48}{space 3}0.000{col 56}{space 4} .0366809{col 69}{space 3} .0447362
{txt}age_firstbirth {c |}{col 16}{res}{space 2} .0227735{col 28}{space 2} .0028281{col 39}{space 1}    8.05{col 48}{space 3}0.000{col 56}{space 4} .0172306{col 69}{space 3} .0283165
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} .0086106{col 28}{space 2}  .004149{col 39}{space 1}    2.08{col 48}{space 3}0.038{col 56}{space 4} .0004787{col 69}{space 3} .0167424
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2}  .001724{col 28}{space 2} .0041151{col 39}{space 1}    0.42{col 48}{space 3}0.675{col 56}{space 4}-.0063415{col 69}{space 3} .0097894
{txt}{space 9}black {c |}{col 16}{res}{space 2}-.1493465{col 28}{space 2} .0113395{col 39}{space 1}  -13.17{col 48}{space 3}0.000{col 56}{space 4}-.1715714{col 69}{space 3}-.1271216
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-.3346379{col 28}{space 2} .0192191{col 39}{space 1}  -17.41{col 48}{space 3}0.000{col 56}{space 4}-.3723065{col 69}{space 3}-.2969692
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}-.1951881{col 28}{space 2} .0177996{col 39}{space 1}  -10.97{col 48}{space 3}0.000{col 56}{space 4}-.2300747{col 69}{space 3}-.1603015
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 8.857625{col 28}{space 2} .0311027{col 39}{space 1}  284.79{col 48}{space 3}0.000{col 56}{space 4} 8.796665{col 69}{space 3} 8.918585
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedwomen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}   6568.86
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0296
{txt}{col 51}Root MSE{col 67}=    {res} 1.2368

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}ln_non_wifei~e{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}  .033367{col 28}{space 2} .0716072{col 39}{space 1}    0.47{col 48}{space 3}0.641{col 56}{space 4}-.1069804{col 69}{space 3} .1737145
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0292746{col 28}{space 2} .0024679{col 39}{space 1}   11.86{col 48}{space 3}0.000{col 56}{space 4} .0244376{col 69}{space 3} .0341115
{txt}age_firstbirth {c |}{col 16}{res}{space 2} .0381927{col 28}{space 2} .0034036{col 39}{space 1}   11.22{col 48}{space 3}0.000{col 56}{space 4} .0315217{col 69}{space 3} .0448637
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} .0087775{col 28}{space 2} .0049709{col 39}{space 1}    1.77{col 48}{space 3}0.077{col 56}{space 4}-.0009652{col 69}{space 3} .0185202
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2}  .007205{col 28}{space 2} .0049539{col 39}{space 1}    1.45{col 48}{space 3}0.146{col 56}{space 4}-.0025045{col 69}{space 3} .0169145
{txt}{space 9}black {c |}{col 16}{res}{space 2}-.4119571{col 28}{space 2} .0151165{col 39}{space 1}  -27.25{col 48}{space 3}0.000{col 56}{space 4}-.4415848{col 69}{space 3}-.3823294
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} -.417373{col 28}{space 2} .0225332{col 39}{space 1}  -18.52{col 48}{space 3}0.000{col 56}{space 4}-.4615373{col 69}{space 3}-.3732087
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}-.3078978{col 28}{space 2} .0201578{col 39}{space 1}  -15.27{col 48}{space 3}0.000{col 56}{space 4}-.3474063{col 69}{space 3}-.2683892
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 8.653399{col 28}{space 2} .0371307{col 39}{space 1}  233.05{col 48}{space 3}0.000{col 56}{space 4} 8.580624{col 69}{space 3} 8.726174
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedwomen_iv.txt""':seeout}

{com}. 
. foreach var of varlist workedforpay us80a_wkswork1 us80a_uhrswork labor_income_1995 ln_us80a_ftotinc_1995 ln_non_wifeincome {c -(}
{txt}  2{com}.         ivregress 2sls `var' (morethantwo = twoboysgirls) age age_firstbirth boyfirst black hispanic other_race if married == 1, r
{txt}  3{com}.         outreg2 using table7_marriedwomen_iv2, keep(morethantwo) nocon ctitle(Married Women - IV(twoboysgirls), `var') 
{txt}  4{com}. {c )-}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}7{txt}){col 67}= {res}   7276.41
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0480
{txt}{col 51}Root MSE{col 67}=    {res} .48723

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}  workedforpay{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-.1268518{col 28}{space 2} .0282765{col 39}{space 1}   -4.49{col 48}{space 3}0.000{col 56}{space 4}-.1822727{col 69}{space 3} -.071431
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0223806{col 28}{space 2} .0009659{col 39}{space 1}   23.17{col 48}{space 3}0.000{col 56}{space 4} .0204874{col 69}{space 3} .0242738
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-.0269208{col 28}{space 2} .0013373{col 39}{space 1}  -20.13{col 48}{space 3}0.000{col 56}{space 4}-.0295419{col 69}{space 3}-.0242997
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} .0002623{col 28}{space 2} .0019613{col 39}{space 1}    0.13{col 48}{space 3}0.894{col 56}{space 4}-.0035817{col 69}{space 3} .0041064
{txt}{space 9}black {c |}{col 16}{res}{space 2} .1922794{col 28}{space 2} .0045009{col 39}{space 1}   42.72{col 48}{space 3}0.000{col 56}{space 4} .1834578{col 69}{space 3}  .201101
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} .0142512{col 28}{space 2} .0077601{col 39}{space 1}    1.84{col 48}{space 3}0.066{col 56}{space 4}-.0009582{col 69}{space 3} .0294607
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} .0564735{col 28}{space 2} .0060201{col 39}{space 1}    9.38{col 48}{space 3}0.000{col 56}{space 4} .0446742{col 69}{space 3} .0682727
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .4688218{col 28}{space 2} .0144909{col 39}{space 1}   32.35{col 48}{space 3}0.000{col 56}{space 4} .4404203{col 69}{space 3} .4972234
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedwomen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}7{txt}){col 67}= {res}  11277.77
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0675
{txt}{col 51}Root MSE{col 67}=    {res} 21.042

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}us80a_wkswork1{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-5.720499{col 28}{space 2} 1.221252{col 39}{space 1}   -4.68{col 48}{space 3}0.000{col 56}{space 4} -8.11411{col 69}{space 3}-3.326888
{txt}{space 11}age {c |}{col 16}{res}{space 2} 1.290143{col 28}{space 2} .0416581{col 39}{space 1}   30.97{col 48}{space 3}0.000{col 56}{space 4} 1.208495{col 69}{space 3} 1.371791
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-1.279075{col 28}{space 2} .0578174{col 39}{space 1}  -22.12{col 48}{space 3}0.000{col 56}{space 4}-1.392395{col 69}{space 3}-1.165755
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-.0467889{col 28}{space 2} .0846981{col 39}{space 1}   -0.55{col 48}{space 3}0.581{col 56}{space 4}-.2127941{col 69}{space 3} .1192164
{txt}{space 9}black {c |}{col 16}{res}{space 2} 10.66935{col 28}{space 2} .2140942{col 39}{space 1}   49.83{col 48}{space 3}0.000{col 56}{space 4} 10.24973{col 69}{space 3} 11.08897
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} .8025076{col 28}{space 2} .3297363{col 39}{space 1}    2.43{col 48}{space 3}0.015{col 56}{space 4} .1562363{col 69}{space 3} 1.448779
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} 3.911147{col 28}{space 2} .2717924{col 39}{space 1}   14.39{col 48}{space 3}0.000{col 56}{space 4} 3.378444{col 69}{space 3}  4.44385
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}  9.04336{col 28}{space 2} .6120559{col 39}{space 1}   14.78{col 48}{space 3}0.000{col 56}{space 4} 7.843752{col 69}{space 3} 10.24297
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedwomen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}7{txt}){col 67}= {res}  10924.72
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0629
{txt}{col 51}Root MSE{col 67}=    {res} 17.727

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}us80a_uhrswork{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-5.087551{col 28}{space 2} 1.028929{col 39}{space 1}   -4.94{col 48}{space 3}0.000{col 56}{space 4}-7.104214{col 69}{space 3}-3.070888
{txt}{space 11}age {c |}{col 16}{res}{space 2} .7955123{col 28}{space 2} .0351785{col 39}{space 1}   22.61{col 48}{space 3}0.000{col 56}{space 4} .7265638{col 69}{space 3} .8644608
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-1.266215{col 28}{space 2} .0486469{col 39}{space 1}  -26.03{col 48}{space 3}0.000{col 56}{space 4}-1.361561{col 69}{space 3}-1.170869
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} .0423099{col 28}{space 2} .0713361{col 39}{space 1}    0.59{col 48}{space 3}0.553{col 56}{space 4}-.0975063{col 69}{space 3} .1821261
{txt}{space 9}black {c |}{col 16}{res}{space 2}  9.72473{col 28}{space 2} .1802541{col 39}{space 1}   53.95{col 48}{space 3}0.000{col 56}{space 4} 9.371438{col 69}{space 3} 10.07802
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} 2.766782{col 28}{space 2} .2959575{col 39}{space 1}    9.35{col 48}{space 3}0.000{col 56}{space 4} 2.186716{col 69}{space 3} 3.346848
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} 5.028645{col 28}{space 2} .2385447{col 39}{space 1}   21.08{col 48}{space 3}0.000{col 56}{space 4} 4.561106{col 69}{space 3} 5.496184
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 21.22377{col 28}{space 2} .5286241{col 39}{space 1}   40.15{col 48}{space 3}0.000{col 56}{space 4} 20.18769{col 69}{space 3} 22.25986
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedwomen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}7{txt}){col 67}= {res}   8334.12
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0495
{txt}{col 51}Root MSE{col 67}=    {res}   9922

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}labor_inc~1995{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-1345.007{col 28}{space 2} 575.5621{col 39}{space 1}   -2.34{col 48}{space 3}0.019{col 56}{space 4}-2473.088{col 69}{space 3}-216.9264
{txt}{space 11}age {c |}{col 16}{res}{space 2} 476.3947{col 28}{space 2} 19.54058{col 39}{space 1}   24.38{col 48}{space 3}0.000{col 56}{space 4} 438.0959{col 69}{space 3} 514.6936
{txt}age_firstbirth {c |}{col 16}{res}{space 2}-264.2338{col 28}{space 2} 27.42755{col 39}{space 1}   -9.63{col 48}{space 3}0.000{col 56}{space 4}-317.9908{col 69}{space 3}-210.4768
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} 18.64609{col 28}{space 2} 40.01884{col 39}{space 1}    0.47{col 48}{space 3}0.641{col 56}{space 4}-59.78941{col 69}{space 3} 97.08158
{txt}{space 9}black {c |}{col 16}{res}{space 2} 6062.152{col 28}{space 2} 116.7363{col 39}{space 1}   51.93{col 48}{space 3}0.000{col 56}{space 4} 5833.354{col 69}{space 3} 6290.951
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} 794.2395{col 28}{space 2} 155.7809{col 39}{space 1}    5.10{col 48}{space 3}0.000{col 56}{space 4} 488.9147{col 69}{space 3} 1099.564
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} 3229.699{col 28}{space 2} 158.7688{col 39}{space 1}   20.34{col 48}{space 3}0.000{col 56}{space 4} 2918.518{col 69}{space 3}  3540.88
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-2446.419{col 28}{space 2} 288.8546{col 39}{space 1}   -8.47{col 48}{space 3}0.000{col 56}{space 4}-3012.564{col 69}{space 3}-1880.275
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedwomen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}7{txt}){col 67}= {res}   7679.64
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0361
{txt}{col 51}Root MSE{col 67}=    {res} 1.0295

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}ln_us80a_~1995{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-.0485254{col 28}{space 2} .0597521{col 39}{space 1}   -0.81{col 48}{space 3}0.417{col 56}{space 4}-.1656374{col 69}{space 3} .0685867
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0406854{col 28}{space 2} .0020599{col 39}{space 1}   19.75{col 48}{space 3}0.000{col 56}{space 4} .0366481{col 69}{space 3} .0447228
{txt}age_firstbirth {c |}{col 16}{res}{space 2}  .022807{col 28}{space 2} .0028351{col 39}{space 1}    8.04{col 48}{space 3}0.000{col 56}{space 4} .0172503{col 69}{space 3} .0283637
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} .0086345{col 28}{space 2} .0041491{col 39}{space 1}    2.08{col 48}{space 3}0.037{col 56}{space 4} .0005025{col 69}{space 3} .0167665
{txt}{space 9}black {c |}{col 16}{res}{space 2}-.1494072{col 28}{space 2} .0113419{col 39}{space 1}  -13.17{col 48}{space 3}0.000{col 56}{space 4} -.171637{col 69}{space 3}-.1271774
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-.3347547{col 28}{space 2} .0192326{col 39}{space 1}  -17.41{col 48}{space 3}0.000{col 56}{space 4}-.3724499{col 69}{space 3}-.2970596
{txt}{space 4}other_race {c |}{col 16}{res}{space 2} -.195238{col 28}{space 2} .0178015{col 39}{space 1}  -10.97{col 48}{space 3}0.000{col 56}{space 4}-.2301283{col 69}{space 3}-.1603477
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 8.858207{col 28}{space 2} .0309736{col 39}{space 1}  285.99{col 48}{space 3}0.000{col 56}{space 4}   8.7975{col 69}{space 3} 8.918914
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedwomen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}7{txt}){col 67}= {res}   6564.74
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0295
{txt}{col 51}Root MSE{col 67}=    {res} 1.2369

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}ln_non_wifei~e{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2} .0363931{col 28}{space 2} .0718292{col 39}{space 1}    0.51{col 48}{space 3}0.612{col 56}{space 4}-.1043895{col 69}{space 3} .1771757
{txt}{space 11}age {c |}{col 16}{res}{space 2}  .029178{col 28}{space 2} .0024749{col 39}{space 1}   11.79{col 48}{space 3}0.000{col 56}{space 4} .0243272{col 69}{space 3} .0340288
{txt}age_firstbirth {c |}{col 16}{res}{space 2} .0383324{col 28}{space 2} .0034136{col 39}{space 1}   11.23{col 48}{space 3}0.000{col 56}{space 4} .0316419{col 69}{space 3}  .045023
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} .0088775{col 28}{space 2} .0049703{col 39}{space 1}    1.79{col 48}{space 3}0.074{col 56}{space 4}-.0008641{col 69}{space 3} .0186191
{txt}{space 9}black {c |}{col 16}{res}{space 2}-.4122106{col 28}{space 2}  .015125{col 39}{space 1}  -27.25{col 48}{space 3}0.000{col 56}{space 4} -.441855{col 69}{space 3}-.3825662
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-.4178614{col 28}{space 2} .0225515{col 39}{space 1}  -18.53{col 48}{space 3}0.000{col 56}{space 4}-.4620615{col 69}{space 3}-.3736613
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}-.3081065{col 28}{space 2} .0201616{col 39}{space 1}  -15.28{col 48}{space 3}0.000{col 56}{space 4}-.3476224{col 69}{space 3}-.2685906
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 8.655831{col 28}{space 2} .0369623{col 39}{space 1}  234.18{col 48}{space 3}0.000{col 56}{space 4} 8.583387{col 69}{space 3} 8.728276
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedwomen_iv2.txt""':seeout}

{com}. 
. * 3) Husbands of Married Women
. 
. cap erase table7_marriedmen.xls
{txt}
{com}. foreach var of varlist workedforpay_father us80a_wkswork1_father us80a_uhrswork_father labor_income_1995_father {c -(}
{txt}  2{com}.         reg `var' morethantwo age age_firstbirth boyfirst boysecond black hispanic other_race if married == 1
{txt}  3{com}.         outreg2 using table7_marriedmen, keep(morethantwo) nocon ctitle(Married Husbands - OLS, `var')
{txt}  4{com}. {c )-}

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   251,646
{txt}{hline 13}{c +}{hline 34}   F(8, 251637)    = {res}   286.14
{txt}       Model {c |} {res} 50.1951575         8  6.27439469   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 5517.83077   251,637   .02192774   {txt}R-squared       ={res}    0.0090
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0090
{txt}       Total {c |} {res} 5568.02593   251,645  .022126511   {txt}Root MSE        =   {res} .14808

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}workedforpay~r{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-.0068315{col 28}{space 2} .0006384{col 39}{space 1}  -10.70{col 48}{space 3}0.000{col 56}{space 4}-.0080827{col 69}{space 3}-.0055802
{txt}{space 11}age {c |}{col 16}{res}{space 2}-.0001521{col 28}{space 2} .0000966{col 39}{space 1}   -1.57{col 48}{space 3}0.115{col 56}{space 4}-.0003414{col 69}{space 3} .0000373
{txt}age_firstbirth {c |}{col 16}{res}{space 2} .0023575{col 28}{space 2} .0001135{col 39}{space 1}   20.76{col 48}{space 3}0.000{col 56}{space 4}  .002135{col 69}{space 3} .0025801
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} .0003073{col 28}{space 2} .0005907{col 39}{space 1}    0.52{col 48}{space 3}0.603{col 56}{space 4}-.0008504{col 69}{space 3} .0014651
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2} .0015018{col 28}{space 2} .0005906{col 39}{space 1}    2.54{col 48}{space 3}0.011{col 56}{space 4} .0003442{col 69}{space 3} .0026594
{txt}{space 9}black {c |}{col 16}{res}{space 2}-.0368462{col 28}{space 2} .0013649{col 39}{space 1}  -27.00{col 48}{space 3}0.000{col 56}{space 4}-.0395214{col 69}{space 3}-.0341711
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-.0335132{col 28}{space 2} .0018656{col 39}{space 1}  -17.96{col 48}{space 3}0.000{col 56}{space 4}-.0371698{col 69}{space 3}-.0298566
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}  -.03741{col 28}{space 2} .0017432{col 39}{space 1}  -21.46{col 48}{space 3}0.000{col 56}{space 4}-.0408267{col 69}{space 3}-.0339933
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .9359757{col 28}{space 2} .0029776{col 39}{space 1}  314.34{col 48}{space 3}0.000{col 56}{space 4} .9301397{col 69}{space 3} .9418118
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedmen.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}   251,646
{txt}{hline 13}{c +}{hline 34}   F(8, 251637)    = {res}   762.69
{txt}       Model {c |} {res} 645291.232         8  80661.4039   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 26612814.1   251,637  105.758748   {txt}R-squared       ={res}    0.0237
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0236
{txt}       Total {c |} {res} 27258105.3   251,645  108.319678   {txt}Root MSE        =   {res} 10.284

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}us80a_wkswor~r{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-.7173453{col 28}{space 2} .0443355{col 39}{space 1}  -16.18{col 48}{space 3}0.000{col 56}{space 4}-.8042416{col 69}{space 3} -.630449
{txt}{space 11}age {c |}{col 16}{res}{space 2} .1376758{col 28}{space 2} .0067093{col 39}{space 1}   20.52{col 48}{space 3}0.000{col 56}{space 4} .1245257{col 69}{space 3} .1508258
{txt}age_firstbirth {c |}{col 16}{res}{space 2} .2583286{col 28}{space 2} .0078853{col 39}{space 1}   32.76{col 48}{space 3}0.000{col 56}{space 4} .2428736{col 69}{space 3} .2737837
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-.0381914{col 28}{space 2} .0410231{col 39}{space 1}   -0.93{col 48}{space 3}0.352{col 56}{space 4}-.1185955{col 69}{space 3} .0422127
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2} .0852832{col 28}{space 2}  .041018{col 39}{space 1}    2.08{col 48}{space 3}0.038{col 56}{space 4}  .004889{col 69}{space 3} .1656773
{txt}{space 9}black {c |}{col 16}{res}{space 2}-3.255522{col 28}{space 2}  .094789{col 39}{space 1}  -34.34{col 48}{space 3}0.000{col 56}{space 4}-3.441306{col 69}{space 3}-3.069738
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-3.664103{col 28}{space 2} .1295655{col 39}{space 1}  -28.28{col 48}{space 3}0.000{col 56}{space 4}-3.918048{col 69}{space 3}-3.410158
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}-3.711801{col 28}{space 2}  .121065{col 39}{space 1}  -30.66{col 48}{space 3}0.000{col 56}{space 4}-3.949085{col 69}{space 3}-3.474517
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 38.81356{col 28}{space 2} .2067901{col 39}{space 1}  187.70{col 48}{space 3}0.000{col 56}{space 4} 38.40826{col 69}{space 3} 39.21886
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedmen.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}   251,646
{txt}{hline 13}{c +}{hline 34}   F(8, 251637)    = {res}   506.21
{txt}       Model {c |} {res} 598132.969         8  74766.6211   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 37166391.7   251,637  147.698438   {txt}R-squared       ={res}    0.0158
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0158
{txt}       Total {c |} {res} 37764524.7   251,645  150.070634   {txt}Root MSE        =   {res} 12.153

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}us80a_uhrswo~r{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2} .2761847{col 28}{space 2} .0523939{col 39}{space 1}    5.27{col 48}{space 3}0.000{col 56}{space 4}  .173494{col 69}{space 3} .3788754
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0264435{col 28}{space 2} .0079288{col 39}{space 1}    3.34{col 48}{space 3}0.001{col 56}{space 4} .0109033{col 69}{space 3} .0419838
{txt}age_firstbirth {c |}{col 16}{res}{space 2} .1957548{col 28}{space 2} .0093186{col 39}{space 1}   21.01{col 48}{space 3}0.000{col 56}{space 4} .1774906{col 69}{space 3}  .214019
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-.0499317{col 28}{space 2} .0484795{col 39}{space 1}   -1.03{col 48}{space 3}0.303{col 56}{space 4}-.1449502{col 69}{space 3} .0450867
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2} .0448614{col 28}{space 2} .0484735{col 39}{space 1}    0.93{col 48}{space 3}0.355{col 56}{space 4}-.0501453{col 69}{space 3} .1398681
{txt}{space 9}black {c |}{col 16}{res}{space 2}-5.168863{col 28}{space 2}  .112018{col 39}{space 1}  -46.14{col 48}{space 3}0.000{col 56}{space 4}-5.388416{col 69}{space 3}-4.949311
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} -4.39279{col 28}{space 2} .1531155{col 39}{space 1}  -28.69{col 48}{space 3}0.000{col 56}{space 4}-4.692893{col 69}{space 3}-4.092688
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}-3.264801{col 28}{space 2}   .14307{col 39}{space 1}  -22.82{col 48}{space 3}0.000{col 56}{space 4}-3.545214{col 69}{space 3}-2.984388
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 38.82875{col 28}{space 2} .2443766{col 39}{space 1}  158.89{col 48}{space 3}0.000{col 56}{space 4} 38.34978{col 69}{space 3} 39.30772
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedmen.txt""':seeout}

      Source {c |}       SS           df       MS      Number of obs   ={res}   251,646
{txt}{hline 13}{c +}{hline 34}   F(8, 251637)    = {res}  2834.39
{txt}       Model {c |} {res} 1.3043e+13         8  1.6304e+12   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1.4475e+14   251,637   575227617   {txt}R-squared       ={res}    0.0827
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0826
{txt}       Total {c |} {res} 1.5779e+14   251,645   627041776   {txt}Root MSE        =   {res}  23984

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}labor_income~r{col 16}{c |} Coefficient{col 28}  Std. err.{col 40}      t{col 48}   P>|t|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-994.2158{col 28}{space 2} 103.3982{col 39}{space 1}   -9.62{col 48}{space 3}0.000{col 56}{space 4}-1196.874{col 69}{space 3}-791.5582
{txt}{space 11}age {c |}{col 16}{res}{space 2} 1201.182{col 28}{space 2}  15.6473{col 39}{space 1}   76.77{col 48}{space 3}0.000{col 56}{space 4} 1170.513{col 69}{space 3}  1231.85
{txt}age_firstbirth {c |}{col 16}{res}{space 2} 1216.624{col 28}{space 2} 18.39001{col 39}{space 1}   66.16{col 48}{space 3}0.000{col 56}{space 4}  1180.58{col 69}{space 3} 1252.668
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-121.4389{col 28}{space 2}  95.6731{col 39}{space 1}   -1.27{col 48}{space 3}0.204{col 56}{space 4}-308.9556{col 69}{space 3} 66.07786
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2} 48.68226{col 28}{space 2} 95.66123{col 39}{space 1}    0.51{col 48}{space 3}0.611{col 56}{space 4}-138.8112{col 69}{space 3} 236.1757
{txt}{space 9}black {c |}{col 16}{res}{space 2}-9658.061{col 28}{space 2} 221.0648{col 39}{space 1}  -43.69{col 48}{space 3}0.000{col 56}{space 4}-10091.34{col 69}{space 3} -9224.78
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-10634.56{col 28}{space 2} 302.1698{col 39}{space 1}  -35.19{col 48}{space 3}0.000{col 56}{space 4} -11226.8{col 69}{space 3}-10042.31
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}-4926.999{col 28}{space 2} 282.3452{col 39}{space 1}  -17.45{col 48}{space 3}0.000{col 56}{space 4}-5480.388{col 69}{space 3} -4373.61
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-22747.07{col 28}{space 2} 482.2714{col 39}{space 1}  -47.17{col 48}{space 3}0.000{col 56}{space 4}-23692.31{col 69}{space 3}-21801.83
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedmen.txt""':seeout}

{com}. 
. cap erase table7_marriedmen_iv.xls
{txt}
{com}. foreach var of varlist workedforpay_father us80a_wkswork1_father us80a_uhrswork_father labor_income_1995_father {c -(}
{txt}  2{com}.         ivregress 2sls `var' (morethantwo = samesex) age age_firstbirth boyfirst boysecond black hispanic other_race if married == 1, r
{txt}  3{com}.         outreg2 using table7_marriedmen_iv, keep(morethantwo) nocon ctitle(Married Husbands, IV(samesex), `var')
{txt}  4{com}.         {c )-}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}   1220.11
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0076
{txt}{col 51}Root MSE{col 67}=    {res} .14819

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}workedforpay~r{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2} .0053903{col 28}{space 2} .0085757{col 39}{space 1}    0.63{col 48}{space 3}0.530{col 56}{space 4}-.0114178{col 69}{space 3} .0221985
{txt}{space 11}age {c |}{col 16}{res}{space 2}-.0005478{col 28}{space 2} .0002965{col 39}{space 1}   -1.85{col 48}{space 3}0.065{col 56}{space 4} -.001129{col 69}{space 3} .0000334
{txt}age_firstbirth {c |}{col 16}{res}{space 2} .0029145{col 28}{space 2} .0004074{col 39}{space 1}    7.15{col 48}{space 3}0.000{col 56}{space 4} .0021159{col 69}{space 3}  .003713
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}  .000421{col 28}{space 2} .0005938{col 39}{space 1}    0.71{col 48}{space 3}0.478{col 56}{space 4}-.0007428{col 69}{space 3} .0015849
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2} .0016066{col 28}{space 2} .0005956{col 39}{space 1}    2.70{col 48}{space 3}0.007{col 56}{space 4} .0004393{col 69}{space 3}  .002774
{txt}{space 9}black {c |}{col 16}{res}{space 2}-.0375986{col 28}{space 2} .0021766{col 39}{space 1}  -17.27{col 48}{space 3}0.000{col 56}{space 4}-.0418647{col 69}{space 3}-.0333326
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-.0355489{col 28}{space 2} .0031817{col 39}{space 1}  -11.17{col 48}{space 3}0.000{col 56}{space 4}-.0417849{col 69}{space 3}-.0293129
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}-.0381461{col 28}{space 2} .0026822{col 39}{space 1}  -14.22{col 48}{space 3}0.000{col 56}{space 4}-.0434031{col 69}{space 3}-.0328892
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .9313034{col 28}{space 2} .0045593{col 39}{space 1}  204.26{col 48}{space 3}0.000{col 56}{space 4} .9223673{col 69}{space 3} .9402396
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedmen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}   4113.57
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0211
{txt}{col 51}Root MSE{col 67}=    {res} 10.297

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}us80a_wkswor~r{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2} .4205456{col 28}{space 2} .5954934{col 39}{space 1}    0.71{col 48}{space 3}0.480{col 56}{space 4}   -.7466{col 69}{space 3} 1.587691
{txt}{space 11}age {c |}{col 16}{res}{space 2} .1008359{col 28}{space 2} .0205498{col 39}{space 1}    4.91{col 48}{space 3}0.000{col 56}{space 4}  .060559{col 69}{space 3} .1411129
{txt}age_firstbirth {c |}{col 16}{res}{space 2} .3101811{col 28}{space 2} .0282361{col 39}{space 1}   10.99{col 48}{space 3}0.000{col 56}{space 4} .2548393{col 69}{space 3} .3655229
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-.0276047{col 28}{space 2} .0413394{col 39}{space 1}   -0.67{col 48}{space 3}0.504{col 56}{space 4}-.1086286{col 69}{space 3} .0534191
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2} .0950457{col 28}{space 2} .0414165{col 39}{space 1}    2.29{col 48}{space 3}0.022{col 56}{space 4} .0138709{col 69}{space 3} .1762204
{txt}{space 9}black {c |}{col 16}{res}{space 2}-3.325573{col 28}{space 2}  .136367{col 39}{space 1}  -24.39{col 48}{space 3}0.000{col 56}{space 4}-3.592847{col 69}{space 3}-3.058299
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-3.853636{col 28}{space 2} .2053256{col 39}{space 1}  -18.77{col 48}{space 3}0.000{col 56}{space 4}-4.256066{col 69}{space 3}-3.451205
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}-3.780334{col 28}{space 2} .1717563{col 39}{space 1}  -22.01{col 48}{space 3}0.000{col 56}{space 4} -4.11697{col 69}{space 3}-3.443698
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 38.37856{col 28}{space 2} .3196234{col 39}{space 1}  120.07{col 48}{space 3}0.000{col 56}{space 4} 37.75211{col 69}{space 3} 39.00501
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedmen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}   3315.67
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0157
{txt}{col 51}Root MSE{col 67}=    {res} 12.154

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}us80a_uhrswo~r{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2} .6352648{col 28}{space 2} .7029781{col 39}{space 1}    0.90{col 48}{space 3}0.366{col 56}{space 4}-.7425469{col 69}{space 3} 2.013076
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0148181{col 28}{space 2} .0241698{col 39}{space 1}    0.61{col 48}{space 3}0.540{col 56}{space 4}-.0325538{col 69}{space 3}   .06219
{txt}age_firstbirth {c |}{col 16}{res}{space 2} .2121177{col 28}{space 2} .0333624{col 39}{space 1}    6.36{col 48}{space 3}0.000{col 56}{space 4} .1467286{col 69}{space 3} .2775068
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-.0465909{col 28}{space 2} .0488646{col 39}{space 1}   -0.95{col 48}{space 3}0.340{col 56}{space 4}-.1423638{col 69}{space 3} .0491819
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2} .0479422{col 28}{space 2} .0487861{col 39}{space 1}    0.98{col 48}{space 3}0.326{col 56}{space 4}-.0476768{col 69}{space 3} .1435611
{txt}{space 9}black {c |}{col 16}{res}{space 2}-5.190969{col 28}{space 2} .1333933{col 39}{space 1}  -38.91{col 48}{space 3}0.000{col 56}{space 4}-5.452415{col 69}{space 3}-4.929523
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}  -4.4526{col 28}{space 2} .2067568{col 39}{space 1}  -21.54{col 48}{space 3}0.000{col 56}{space 4}-4.857836{col 69}{space 3}-4.047365
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}-3.286428{col 28}{space 2} .1756156{col 39}{space 1}  -18.71{col 48}{space 3}0.000{col 56}{space 4}-3.630628{col 69}{space 3}-2.942227
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 38.69148{col 28}{space 2} .3665443{col 39}{space 1}  105.56{col 48}{space 3}0.000{col 56}{space 4} 37.97307{col 69}{space 3} 39.40989
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedmen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}  23710.74
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0826
{txt}{col 51}Root MSE{col 67}=    {res}  23984

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}labor_income~r{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-1446.806{col 28}{space 2}  1386.51{col 39}{space 1}   -1.04{col 48}{space 3}0.297{col 56}{space 4}-4164.316{col 69}{space 3} 1270.703
{txt}{space 11}age {c |}{col 16}{res}{space 2} 1215.834{col 28}{space 2} 47.12355{col 39}{space 1}   25.80{col 48}{space 3}0.000{col 56}{space 4} 1123.474{col 69}{space 3} 1308.195
{txt}age_firstbirth {c |}{col 16}{res}{space 2}     1196{col 28}{space 2} 66.23222{col 39}{space 1}   18.06{col 48}{space 3}0.000{col 56}{space 4} 1066.187{col 69}{space 3} 1325.812
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-125.6497{col 28}{space 2} 96.57844{col 39}{space 1}   -1.30{col 48}{space 3}0.193{col 56}{space 4}-314.9399{col 69}{space 3}  63.6406
{txt}{space 5}boysecond {c |}{col 16}{res}{space 2} 44.79927{col 28}{space 2} 96.28385{col 39}{space 1}    0.47{col 48}{space 3}0.642{col 56}{space 4}-143.9136{col 69}{space 3} 233.5122
{txt}{space 9}black {c |}{col 16}{res}{space 2}-9630.198{col 28}{space 2} 192.4802{col 39}{space 1}  -50.03{col 48}{space 3}0.000{col 56}{space 4}-10007.45{col 69}{space 3}-9252.944
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-10559.17{col 28}{space 2} 324.3339{col 39}{space 1}  -32.56{col 48}{space 3}0.000{col 56}{space 4}-11194.85{col 69}{space 3}-9923.489
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}-4899.741{col 28}{space 2} 336.4646{col 39}{space 1}  -14.56{col 48}{space 3}0.000{col 56}{space 4}-5559.199{col 69}{space 3}-4240.282
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-22574.05{col 28}{space 2} 707.7769{col 39}{space 1}  -31.89{col 48}{space 3}0.000{col 56}{space 4}-23961.27{col 69}{space 3}-21186.83
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedmen_iv.txt""':seeout}

{com}. 
. cap erase table7_marriedmen_iv2.xls
{txt}
{com}. foreach var of varlist workedforpay_father us80a_wkswork1_father us80a_uhrswork_father labor_income_1995_father {c -(}
{txt}  2{com}.         ivregress 2sls `var' (morethantwo = twoboysgirls) age age_firstbirth boyfirst black hispanic other_race if married == 1, r
{txt}  3{com}.         outreg2 using table7_marriedmen_iv2, keep(morethantwo) nocon ctitle(Married Husbands, IV(twoboysgirls), `var') 
{txt}  4{com}. {c )-}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}7{txt}){col 67}= {res}   1215.15
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0074
{txt}{col 51}Root MSE{col 67}=    {res}  .1482

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}workedforpay~r{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2} .0060651{col 28}{space 2} .0086093{col 39}{space 1}    0.70{col 48}{space 3}0.481{col 56}{space 4}-.0108089{col 69}{space 3}  .022939
{txt}{space 11}age {c |}{col 16}{res}{space 2}-.0005693{col 28}{space 2} .0002976{col 39}{space 1}   -1.91{col 48}{space 3}0.056{col 56}{space 4}-.0011526{col 69}{space 3}  .000014
{txt}age_firstbirth {c |}{col 16}{res}{space 2} .0029456{col 28}{space 2} .0004089{col 39}{space 1}    7.20{col 48}{space 3}0.000{col 56}{space 4} .0021441{col 69}{space 3} .0037471
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2} .0004433{col 28}{space 2} .0005939{col 39}{space 1}    0.75{col 48}{space 3}0.455{col 56}{space 4}-.0007206{col 69}{space 3} .0016073
{txt}{space 9}black {c |}{col 16}{res}{space 2}-.0376552{col 28}{space 2} .0021777{col 39}{space 1}  -17.29{col 48}{space 3}0.000{col 56}{space 4}-.0419233{col 69}{space 3} -.033387
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-.0356578{col 28}{space 2}  .003185{col 39}{space 1}  -11.20{col 48}{space 3}0.000{col 56}{space 4}-.0419003{col 69}{space 3}-.0294154
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}-.0381927{col 28}{space 2} .0026828{col 39}{space 1}  -14.24{col 48}{space 3}0.000{col 56}{space 4}-.0434509{col 69}{space 3}-.0329345
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} .9318459{col 28}{space 2} .0045353{col 39}{space 1}  205.46{col 48}{space 3}0.000{col 56}{space 4} .9229569{col 69}{space 3} .9407349
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedmen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}7{txt}){col 67}= {res}   4109.10
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0209
{txt}{col 51}Root MSE{col 67}=    {res} 10.298

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}us80a_wkswor~r{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2} .4604645{col 28}{space 2} .5979807{col 39}{space 1}    0.77{col 48}{space 3}0.441{col 56}{space 4}-.7115562{col 69}{space 3} 1.632485
{txt}{space 11}age {c |}{col 16}{res}{space 2}  .099562{col 28}{space 2} .0206272{col 39}{space 1}    4.83{col 48}{space 3}0.000{col 56}{space 4} .0591335{col 69}{space 3} .1399906
{txt}age_firstbirth {c |}{col 16}{res}{space 2} .3120247{col 28}{space 2} .0283488{col 39}{space 1}   11.01{col 48}{space 3}0.000{col 56}{space 4}  .256462{col 69}{space 3} .3675874
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-.0262862{col 28}{space 2} .0413467{col 39}{space 1}   -0.64{col 48}{space 3}0.525{col 56}{space 4}-.1073242{col 69}{space 3} .0547519
{txt}{space 9}black {c |}{col 16}{res}{space 2}-3.328917{col 28}{space 2} .1364352{col 39}{space 1}  -24.40{col 48}{space 3}0.000{col 56}{space 4}-3.596325{col 69}{space 3}-3.061508
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-3.860078{col 28}{space 2} .2055669{col 39}{space 1}  -18.78{col 48}{space 3}0.000{col 56}{space 4}-4.262982{col 69}{space 3}-3.457174
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}-3.783087{col 28}{space 2}  .171811{col 39}{space 1}  -22.02{col 48}{space 3}0.000{col 56}{space 4} -4.11983{col 69}{space 3}-3.446344
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 38.41065{col 28}{space 2} .3178778{col 39}{space 1}  120.83{col 48}{space 3}0.000{col 56}{space 4} 37.78762{col 69}{space 3} 39.03368
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedmen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}7{txt}){col 67}= {res}   3314.52
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0156
{txt}{col 51}Root MSE{col 67}=    {res} 12.154

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}us80a_uhrswo~r{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2} .6554003{col 28}{space 2} .7055525{col 39}{space 1}    0.93{col 48}{space 3}0.353{col 56}{space 4}-.7274573{col 69}{space 3} 2.038258
{txt}{space 11}age {c |}{col 16}{res}{space 2} .0141756{col 28}{space 2} .0242478{col 39}{space 1}    0.58{col 48}{space 3}0.559{col 56}{space 4}-.0333492{col 69}{space 3} .0617004
{txt}age_firstbirth {c |}{col 16}{res}{space 2} .2130476{col 28}{space 2}  .033478{col 39}{space 1}    6.36{col 48}{space 3}0.000{col 56}{space 4}  .147432{col 69}{space 3} .2786632
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-.0459258{col 28}{space 2} .0488717{col 39}{space 1}   -0.94{col 48}{space 3}0.347{col 56}{space 4}-.1417127{col 69}{space 3}  .049861
{txt}{space 9}black {c |}{col 16}{res}{space 2}-5.192656{col 28}{space 2} .1334628{col 39}{space 1}  -38.91{col 48}{space 3}0.000{col 56}{space 4}-5.454238{col 69}{space 3}-4.931073
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2} -4.45585{col 28}{space 2} .2069959{col 39}{space 1}  -21.53{col 48}{space 3}0.000{col 56}{space 4}-4.861555{col 69}{space 3}-4.050146
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}-3.287816{col 28}{space 2} .1756588{col 39}{space 1}  -18.72{col 48}{space 3}0.000{col 56}{space 4}-3.632101{col 69}{space 3}-2.943531
{txt}{space 9}_cons {c |}{col 16}{res}{space 2} 38.70767{col 28}{space 2} .3644656{col 39}{space 1}  106.20{col 48}{space 3}0.000{col 56}{space 4} 37.99333{col 69}{space 3}   39.422
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedmen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}7{txt}){col 67}= {res}  23710.39
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0826
{txt}{col 51}Root MSE{col 67}=    {res}  23984

{txt}{hline 15}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 16}{c |}{col 28}    Robust
{col 1}labor_income~r{col 16}{c |} Coefficient{col 28}  std. err.{col 40}      z{col 48}   P>|z|{col 56}     [95% con{col 69}f. interval]
{hline 15}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 3}morethantwo {c |}{col 16}{res}{space 2}-1427.991{col 28}{space 2} 1391.713{col 39}{space 1}   -1.03{col 48}{space 3}0.305{col 56}{space 4}-4155.699{col 69}{space 3} 1299.717
{txt}{space 11}age {c |}{col 16}{res}{space 2} 1215.234{col 28}{space 2} 47.28316{col 39}{space 1}   25.70{col 48}{space 3}0.000{col 56}{space 4} 1122.561{col 69}{space 3} 1307.907
{txt}age_firstbirth {c |}{col 16}{res}{space 2} 1196.869{col 28}{space 2} 66.46324{col 39}{space 1}   18.01{col 48}{space 3}0.000{col 56}{space 4} 1066.603{col 69}{space 3} 1327.134
{txt}{space 6}boyfirst {c |}{col 16}{res}{space 2}-125.0282{col 28}{space 2} 96.59601{col 39}{space 1}   -1.29{col 48}{space 3}0.196{col 56}{space 4}-314.3528{col 69}{space 3} 64.29654
{txt}{space 9}black {c |}{col 16}{res}{space 2}-9631.774{col 28}{space 2} 192.6775{col 39}{space 1}  -49.99{col 48}{space 3}0.000{col 56}{space 4}-10009.42{col 69}{space 3}-9254.133
{txt}{space 6}hispanic {c |}{col 16}{res}{space 2}-10562.21{col 28}{space 2} 324.9428{col 39}{space 1}  -32.50{col 48}{space 3}0.000{col 56}{space 4}-11199.08{col 69}{space 3}-9925.332
{txt}{space 4}other_race {c |}{col 16}{res}{space 2}-4901.039{col 28}{space 2} 336.5441{col 39}{space 1}  -14.56{col 48}{space 3}0.000{col 56}{space 4}-5560.653{col 69}{space 3}-4241.424
{txt}{space 9}_cons {c |}{col 16}{res}{space 2}-22558.93{col 28}{space 2}  703.543{col 39}{space 1}  -32.06{col 48}{space 3}0.000{col 56}{space 4}-23937.84{col 69}{space 3}-21180.01
{txt}{hline 15}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 27}Instrumented: {res:morethantwo}{p_end}
{p 0 14 27}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table7_marriedmen_iv2.txt""':seeout}

{com}. 
. 
. 
. 
. 
. * Additional Results - Heterogeneous treatment effect: Including interaction of morethantwo with black
. gen morethantwo_black = (morethantwo == 1) & (black == 1)
{txt}
{com}. gen samesex_black = (samesex == 1) & (black == 1)
{txt}
{com}. gen twoboysgirls_black = (twoboysgirls == 1) & (black == 1)
{txt}
{com}. 
. * 1) All women
. foreach var of varlist workedforpay us80a_wkswork1 us80a_uhrswork labor_income_1995 ln_us80a_ftotinc_1995 {c -(}
{txt}  2{com}.         ivregress 2sls `var' (morethantwo morethantwo_black = samesex samesex_black) age age_firstbirth boyfirst boysecond black hispanic other_race, r
{txt}  3{com}.         outreg2 using table_new_allwomen_iv, keep(morethantwo morethantwo_black) nocon ctitle(All Women - IV(samesex, samesex_black), `var')
{txt}  4{com}. {c )-}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}9{txt}){col 67}= {res}  11042.80
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0488
{txt}{col 51}Root MSE{col 67}=    {res} .48388

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}     workedforpay{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2}-.1132391{col 31}{space 2} .0263636{col 42}{space 1}   -4.30{col 51}{space 3}0.000{col 59}{space 4}-.1649108{col 72}{space 3}-.0615675
{txt}morethantwo_black {c |}{col 19}{res}{space 2}-.1730223{col 31}{space 2} .1100815{col 42}{space 1}   -1.57{col 51}{space 3}0.116{col 59}{space 4}-.3887781{col 72}{space 3} .0427335
{txt}{space 14}age {c |}{col 19}{res}{space 2} .0233438{col 31}{space 2} .0008827{col 42}{space 1}   26.44{col 51}{space 3}0.000{col 59}{space 4} .0216137{col 72}{space 3}  .025074
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2}-.0266988{col 31}{space 2} .0012692{col 42}{space 1}  -21.04{col 51}{space 3}0.000{col 59}{space 4}-.0291863{col 72}{space 3}-.0242113
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2}-.0014497{col 31}{space 2} .0015516{col 42}{space 1}   -0.93{col 51}{space 3}0.350{col 59}{space 4}-.0044908{col 72}{space 3} .0015915
{txt}{space 8}boysecond {c |}{col 19}{res}{space 2}-.0035633{col 31}{space 2} .0015531{col 42}{space 1}   -2.29{col 51}{space 3}0.022{col 59}{space 4}-.0066073{col 72}{space 3}-.0005192
{txt}{space 12}black {c |}{col 19}{res}{space 2} .1878355{col 31}{space 2} .0550919{col 42}{space 1}    3.41{col 51}{space 3}0.001{col 59}{space 4} .0798574{col 72}{space 3} .2958135
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2}-.0428011{col 31}{space 2} .0062485{col 42}{space 1}   -6.85{col 51}{space 3}0.000{col 59}{space 4}-.0550478{col 72}{space 3}-.0305544
{txt}{space 7}other_race {c |}{col 19}{res}{space 2} .0383207{col 31}{space 2} .0050165{col 42}{space 1}    7.64{col 51}{space 3}0.000{col 59}{space 4} .0284885{col 72}{space 3} .0481528
{txt}{space 12}_cons {c |}{col 19}{res}{space 2}  .457491{col 31}{space 2} .0129521{col 42}{space 1}   35.32{col 51}{space 3}0.000{col 59}{space 4} .4321053{col 72}{space 3} .4828767
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex samesex_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_allwomen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}9{txt}){col 67}= {res}  19090.78
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0737
{txt}{col 51}Root MSE{col 67}=    {res} 21.388

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}   us80a_wkswork1{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2} -5.55777{col 31}{space 2} 1.155405{col 42}{space 1}   -4.81{col 51}{space 3}0.000{col 59}{space 4}-7.822322{col 72}{space 3}-3.293217
{txt}morethantwo_black {c |}{col 19}{res}{space 2} -7.59479{col 31}{space 2} 5.167464{col 42}{space 1}   -1.47{col 51}{space 3}0.142{col 59}{space 4}-17.72283{col 72}{space 3} 2.533254
{txt}{space 14}age {c |}{col 19}{res}{space 2} 1.422788{col 31}{space 2} .0393587{col 42}{space 1}   36.15{col 51}{space 3}0.000{col 59}{space 4} 1.345646{col 72}{space 3} 1.499929
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2}-1.304705{col 31}{space 2} .0567381{col 42}{space 1}  -23.00{col 51}{space 3}0.000{col 59}{space 4}-1.415909{col 72}{space 3}  -1.1935
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2}-.1362536{col 31}{space 2} .0685786{col 42}{space 1}   -1.99{col 51}{space 3}0.047{col 59}{space 4}-.2706653{col 72}{space 3} -.001842
{txt}{space 8}boysecond {c |}{col 19}{res}{space 2}-.1494202{col 31}{space 2} .0686445{col 42}{space 1}   -2.18{col 51}{space 3}0.030{col 59}{space 4}-.2839609{col 72}{space 3}-.0148796
{txt}{space 12}black {c |}{col 19}{res}{space 2} 9.940325{col 31}{space 2}  2.58961{col 42}{space 1}    3.84{col 51}{space 3}0.000{col 59}{space 4} 4.864783{col 72}{space 3} 15.01587
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2} -1.43666{col 31}{space 2} .2685336{col 42}{space 1}   -5.35{col 51}{space 3}0.000{col 59}{space 4}-1.962976{col 72}{space 3} -.910344
{txt}{space 7}other_race {c |}{col 19}{res}{space 2} 2.590988{col 31}{space 2} .2261852{col 42}{space 1}   11.46{col 51}{space 3}0.000{col 59}{space 4} 2.147673{col 72}{space 3} 3.034303
{txt}{space 12}_cons {c |}{col 19}{res}{space 2} 6.868732{col 31}{space 2} .5604507{col 42}{space 1}   12.26{col 51}{space 3}0.000{col 59}{space 4} 5.770269{col 72}{space 3} 7.967196
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex samesex_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_allwomen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}9{txt}){col 67}= {res}  16327.26
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0627
{txt}{col 51}Root MSE{col 67}=    {res} 18.301

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}   us80a_uhrswork{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2}-4.515925{col 31}{space 2} .9872327{col 42}{space 1}   -4.57{col 51}{space 3}0.000{col 59}{space 4}-6.450866{col 72}{space 3}-2.580984
{txt}morethantwo_black {c |}{col 19}{res}{space 2}-5.322258{col 31}{space 2} 4.461294{col 42}{space 1}   -1.19{col 51}{space 3}0.233{col 59}{space 4}-14.06623{col 72}{space 3} 3.421718
{txt}{space 14}age {c |}{col 19}{res}{space 2} .8706747{col 31}{space 2} .0337959{col 42}{space 1}   25.76{col 51}{space 3}0.000{col 59}{space 4}  .804436{col 72}{space 3} .9369134
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2}-1.269498{col 31}{space 2} .0485739{col 42}{space 1}  -26.14{col 51}{space 3}0.000{col 59}{space 4}-1.364701{col 72}{space 3}-1.174295
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2}-.0769665{col 31}{space 2} .0586674{col 42}{space 1}   -1.31{col 51}{space 3}0.190{col 59}{space 4}-.1919525{col 72}{space 3} .0380194
{txt}{space 8}boysecond {c |}{col 19}{res}{space 2}-.1153087{col 31}{space 2} .0587602{col 42}{space 1}   -1.96{col 51}{space 3}0.050{col 59}{space 4}-.2304765{col 72}{space 3}-.0001409
{txt}{space 12}black {c |}{col 19}{res}{space 2} 8.107478{col 31}{space 2} 2.235844{col 42}{space 1}    3.63{col 51}{space 3}0.000{col 59}{space 4} 3.725304{col 72}{space 3} 12.48965
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2} .2527914{col 31}{space 2} .2405654{col 42}{space 1}    1.05{col 51}{space 3}0.293{col 59}{space 4}-.2187081{col 72}{space 3} .7242909
{txt}{space 7}other_race {c |}{col 19}{res}{space 2} 3.789973{col 31}{space 2} .1999865{col 42}{space 1}   18.95{col 51}{space 3}0.000{col 59}{space 4} 3.398006{col 72}{space 3} 4.181939
{txt}{space 12}_cons {c |}{col 19}{res}{space 2}  20.2981{col 31}{space 2} .4867912{col 42}{space 1}   41.70{col 51}{space 3}0.000{col 59}{space 4}   19.344{col 72}{space 3} 21.25219
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex samesex_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_allwomen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}9{txt}){col 67}= {res}  15694.05
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0577
{txt}{col 51}Root MSE{col 67}=    {res}  10447

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}labor_income_1995{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2}-1886.225{col 31}{space 2} 556.4292{col 42}{space 1}   -3.39{col 51}{space 3}0.001{col 59}{space 4}-2976.806{col 72}{space 3}-795.6438
{txt}morethantwo_black {c |}{col 19}{res}{space 2}-307.3661{col 31}{space 2} 2737.437{col 42}{space 1}   -0.11{col 51}{space 3}0.911{col 59}{space 4}-5672.645{col 72}{space 3} 5057.912
{txt}{space 14}age {c |}{col 19}{res}{space 2}  591.027{col 31}{space 2}  19.4484{col 42}{space 1}   30.39{col 51}{space 3}0.000{col 59}{space 4} 552.9089{col 72}{space 3} 629.1452
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2} -350.947{col 31}{space 2} 28.32935{col 42}{space 1}  -12.39{col 51}{space 3}0.000{col 59}{space 4}-406.4715{col 72}{space 3}-295.4224
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2}-44.83617{col 31}{space 2} 33.49834{col 42}{space 1}   -1.34{col 51}{space 3}0.181{col 59}{space 4}-110.4917{col 72}{space 3} 20.81938
{txt}{space 8}boysecond {c |}{col 19}{res}{space 2}-35.47901{col 31}{space 2} 33.50837{col 42}{space 1}   -1.06{col 51}{space 3}0.290{col 59}{space 4}-101.1542{col 72}{space 3}  30.1962
{txt}{space 12}black {c |}{col 19}{res}{space 2}  3906.68{col 31}{space 2} 1371.816{col 42}{space 1}    2.85{col 51}{space 3}0.004{col 59}{space 4} 1217.971{col 72}{space 3}  6595.39
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2}-59.05422{col 31}{space 2} 125.0005{col 42}{space 1}   -0.47{col 51}{space 3}0.637{col 59}{space 4}-304.0507{col 72}{space 3} 185.9423
{txt}{space 7}other_race {c |}{col 19}{res}{space 2} 2410.193{col 31}{space 2} 128.9985{col 42}{space 1}   18.68{col 51}{space 3}0.000{col 59}{space 4}  2157.36{col 72}{space 3} 2663.025
{txt}{space 12}_cons {c |}{col 19}{res}{space 2}-3037.913{col 31}{space 2} 272.7104{col 42}{space 1}  -11.14{col 51}{space 3}0.000{col 59}{space 4}-3572.416{col 72}{space 3}-2503.411
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex samesex_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_allwomen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}9{txt}){col 67}= {res}  18464.82
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0592
{txt}{col 51}Root MSE{col 67}=    {res} 1.3255

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}ln_us80a_fto~1995{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2} .0247322{col 31}{space 2} .0679869{col 42}{space 1}    0.36{col 51}{space 3}0.716{col 59}{space 4}-.1085196{col 72}{space 3}  .157984
{txt}morethantwo_black {c |}{col 19}{res}{space 2}-.6648864{col 31}{space 2} .4111628{col 42}{space 1}   -1.62{col 51}{space 3}0.106{col 59}{space 4}-1.470751{col 72}{space 3}  .140978
{txt}{space 14}age {c |}{col 19}{res}{space 2} .0465468{col 31}{space 2} .0025855{col 42}{space 1}   18.00{col 51}{space 3}0.000{col 59}{space 4} .0414793{col 72}{space 3} .0516142
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2} .0332053{col 31}{space 2} .0037188{col 42}{space 1}    8.93{col 51}{space 3}0.000{col 59}{space 4} .0259166{col 72}{space 3} .0404939
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2} .0070857{col 31}{space 2}  .004247{col 42}{space 1}    1.67{col 51}{space 3}0.095{col 59}{space 4}-.0012383{col 72}{space 3} .0154097
{txt}{space 8}boysecond {c |}{col 19}{res}{space 2} .0063604{col 31}{space 2} .0042441{col 42}{space 1}    1.50{col 51}{space 3}0.134{col 59}{space 4}-.0019579{col 72}{space 3} .0146786
{txt}{space 12}black {c |}{col 19}{res}{space 2}-.2875423{col 31}{space 2} .2065095{col 42}{space 1}   -1.39{col 51}{space 3}0.164{col 59}{space 4}-.6922935{col 72}{space 3} .1172088
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2} -.511205{col 31}{space 2} .0192636{col 42}{space 1}  -26.54{col 51}{space 3}0.000{col 59}{space 4}-.5489609{col 72}{space 3} -.473449
{txt}{space 7}other_race {c |}{col 19}{res}{space 2}-.2311031{col 31}{space 2}  .016328{col 42}{space 1}  -14.15{col 51}{space 3}0.000{col 59}{space 4}-.2631055{col 72}{space 3}-.1991008
{txt}{space 12}_cons {c |}{col 19}{res}{space 2} 8.287061{col 31}{space 2} .0345944{col 42}{space 1}  239.55{col 51}{space 3}0.000{col 59}{space 4} 8.219258{col 72}{space 3} 8.354865
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex samesex_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_allwomen_iv.txt""':seeout}

{com}. 
. foreach var of varlist workedforpay us80a_wkswork1 us80a_uhrswork labor_income_1995 ln_us80a_ftotinc_1995 {c -(}
{txt}  2{com}.         ivregress 2sls `var' (morethantwo morethantwo_black = twoboysgirls twoboysgirls_black) age age_firstbirth boyfirst black hispanic other_race, r
{txt}  3{com}.         outreg2 using table_new_allwomen_iv2, keep(morethantwo morethantwo_black) nocon ctitle(All Women - IV(twoboysgirls, twoboysgirls_black), `var') 
{txt}  4{com}. {c )-}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}  11039.24
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0489
{txt}{col 51}Root MSE{col 67}=    {res} .48386

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}     workedforpay{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2}-.1145916{col 31}{space 2} .0264407{col 42}{space 1}   -4.33{col 51}{space 3}0.000{col 59}{space 4}-.1664144{col 72}{space 3}-.0627688
{txt}morethantwo_black {c |}{col 19}{res}{space 2}-.1728035{col 31}{space 2} .1101008{col 42}{space 1}   -1.57{col 51}{space 3}0.117{col 59}{space 4} -.388597{col 72}{space 3} .0429901
{txt}{space 14}age {c |}{col 19}{res}{space 2} .0233862{col 31}{space 2} .0008846{col 42}{space 1}   26.44{col 51}{space 3}0.000{col 59}{space 4} .0216524{col 72}{space 3} .0251201
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2}-.0267623{col 31}{space 2}  .001272{col 42}{space 1}  -21.04{col 51}{space 3}0.000{col 59}{space 4}-.0292554{col 72}{space 3}-.0242691
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2}-.0014966{col 31}{space 2} .0015518{col 42}{space 1}   -0.96{col 51}{space 3}0.335{col 59}{space 4} -.004538{col 72}{space 3} .0015448
{txt}{space 12}black {c |}{col 19}{res}{space 2} .1878707{col 31}{space 2} .0550989{col 42}{space 1}    3.41{col 51}{space 3}0.001{col 59}{space 4} .0798788{col 72}{space 3} .2958626
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2}-.0425903{col 31}{space 2} .0062563{col 42}{space 1}   -6.81{col 51}{space 3}0.000{col 59}{space 4}-.0548525{col 72}{space 3}-.0303282
{txt}{space 7}other_race {c |}{col 19}{res}{space 2} .0384443{col 31}{space 2} .0050186{col 42}{space 1}    7.66{col 51}{space 3}0.000{col 59}{space 4}  .028608{col 72}{space 3} .0482806
{txt}{space 12}_cons {c |}{col 19}{res}{space 2} .4562674{col 31}{space 2} .0128779{col 42}{space 1}   35.43{col 51}{space 3}0.000{col 59}{space 4} .4310273{col 72}{space 3} .4815076
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls twoboysgirls_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_allwomen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}  19087.64
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0738
{txt}{col 51}Root MSE{col 67}=    {res} 21.387

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}   us80a_wkswork1{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2}-5.614484{col 31}{space 2} 1.158763{col 42}{space 1}   -4.85{col 51}{space 3}0.000{col 59}{space 4}-7.885617{col 72}{space 3} -3.34335
{txt}morethantwo_black {c |}{col 19}{res}{space 2}-7.585614{col 31}{space 2} 5.168134{col 42}{space 1}   -1.47{col 51}{space 3}0.142{col 59}{space 4}-17.71497{col 72}{space 3} 2.543742
{txt}{space 14}age {c |}{col 19}{res}{space 2} 1.424565{col 31}{space 2} .0394382{col 42}{space 1}   36.12{col 51}{space 3}0.000{col 59}{space 4} 1.347267{col 72}{space 3} 1.501863
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2}-1.307368{col 31}{space 2} .0568587{col 42}{space 1}  -22.99{col 51}{space 3}0.000{col 59}{space 4}-1.418809{col 72}{space 3}-1.195927
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2}-.1382219{col 31}{space 2}  .068579{col 42}{space 1}   -2.02{col 51}{space 3}0.044{col 59}{space 4}-.2726342{col 72}{space 3}-.0038096
{txt}{space 12}black {c |}{col 19}{res}{space 2} 9.941802{col 31}{space 2} 2.589828{col 42}{space 1}    3.84{col 51}{space 3}0.000{col 59}{space 4} 4.865834{col 72}{space 3} 15.01777
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2}-1.427822{col 31}{space 2}  .268879{col 42}{space 1}   -5.31{col 51}{space 3}0.000{col 59}{space 4}-1.954815{col 72}{space 3}-.9008287
{txt}{space 7}other_race {c |}{col 19}{res}{space 2} 2.596173{col 31}{space 2}  .226276{col 42}{space 1}   11.47{col 51}{space 3}0.000{col 59}{space 4}  2.15268{col 72}{space 3} 3.039666
{txt}{space 12}_cons {c |}{col 19}{res}{space 2} 6.817422{col 31}{space 2} .5571179{col 42}{space 1}   12.24{col 51}{space 3}0.000{col 59}{space 4} 5.725491{col 72}{space 3} 7.909353
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls twoboysgirls_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_allwomen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}  16324.81
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0627
{txt}{col 51}Root MSE{col 67}=    {res} 18.301

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}   us80a_uhrswork{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2}-4.559692{col 31}{space 2} .9902062{col 42}{space 1}   -4.60{col 51}{space 3}0.000{col 59}{space 4} -6.50046{col 72}{space 3}-2.618923
{txt}morethantwo_black {c |}{col 19}{res}{space 2}-5.315177{col 31}{space 2} 4.461763{col 42}{space 1}   -1.19{col 51}{space 3}0.234{col 59}{space 4}-14.06007{col 72}{space 3} 3.429718
{txt}{space 14}age {c |}{col 19}{res}{space 2} .8720463{col 31}{space 2} .0338661{col 42}{space 1}   25.75{col 51}{space 3}0.000{col 59}{space 4} .8056699{col 72}{space 3} .9384226
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2}-1.271554{col 31}{space 2} .0486803{col 42}{space 1}  -26.12{col 51}{space 3}0.000{col 59}{space 4}-1.366965{col 72}{space 3}-1.176142
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2}-.0784855{col 31}{space 2} .0586693{col 42}{space 1}   -1.34{col 51}{space 3}0.181{col 59}{space 4}-.1934752{col 72}{space 3} .0365043
{txt}{space 12}black {c |}{col 19}{res}{space 2} 8.108618{col 31}{space 2} 2.235978{col 42}{space 1}    3.63{col 51}{space 3}0.000{col 59}{space 4} 3.726181{col 72}{space 3} 12.49106
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2}  .259612{col 31}{space 2} .2408635{col 42}{space 1}    1.08{col 51}{space 3}0.281{col 59}{space 4}-.2124718{col 72}{space 3} .7316958
{txt}{space 7}other_race {c |}{col 19}{res}{space 2} 3.793974{col 31}{space 2} .2000626{col 42}{space 1}   18.96{col 51}{space 3}0.000{col 59}{space 4} 3.401858{col 72}{space 3} 4.186089
{txt}{space 12}_cons {c |}{col 19}{res}{space 2}  20.2585{col 31}{space 2} .4839509{col 42}{space 1}   41.86{col 51}{space 3}0.000{col 59}{space 4} 19.30998{col 72}{space 3} 21.20703
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls twoboysgirls_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_allwomen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}  15694.49
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0578
{txt}{col 51}Root MSE{col 67}=    {res}  10446

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}labor_income_1995{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2}-1899.691{col 31}{space 2} 558.0336{col 42}{space 1}   -3.40{col 51}{space 3}0.001{col 59}{space 4}-2993.417{col 72}{space 3}-805.9657
{txt}morethantwo_black {c |}{col 19}{res}{space 2}-305.1875{col 31}{space 2} 2737.455{col 42}{space 1}   -0.11{col 51}{space 3}0.911{col 59}{space 4}-5670.502{col 72}{space 3} 5060.126
{txt}{space 14}age {c |}{col 19}{res}{space 2}  591.449{col 31}{space 2} 19.48142{col 42}{space 1}   30.36{col 51}{space 3}0.000{col 59}{space 4} 553.2662{col 72}{space 3} 629.6319
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2}-351.5794{col 31}{space 2} 28.37865{col 42}{space 1}  -12.39{col 51}{space 3}0.000{col 59}{space 4}-407.2005{col 72}{space 3}-295.9583
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2}-45.30352{col 31}{space 2} 33.50319{col 42}{space 1}   -1.35{col 51}{space 3}0.176{col 59}{space 4}-110.9686{col 72}{space 3} 20.36153
{txt}{space 12}black {c |}{col 19}{res}{space 2} 3907.031{col 31}{space 2} 1371.749{col 42}{space 1}    2.85{col 51}{space 3}0.004{col 59}{space 4} 1218.452{col 72}{space 3}  6595.61
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2} -56.9556{col 31}{space 2} 125.1812{col 42}{space 1}   -0.45{col 51}{space 3}0.649{col 59}{space 4}-302.3062{col 72}{space 3}  188.395
{txt}{space 7}other_race {c |}{col 19}{res}{space 2} 2411.424{col 31}{space 2} 129.0328{col 42}{space 1}   18.69{col 51}{space 3}0.000{col 59}{space 4} 2158.524{col 72}{space 3} 2664.323
{txt}{space 12}_cons {c |}{col 19}{res}{space 2}-3050.097{col 31}{space 2} 271.1523{col 42}{space 1}  -11.25{col 51}{space 3}0.000{col 59}{space 4}-3581.546{col 72}{space 3}-2518.648
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls twoboysgirls_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_allwomen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   394,561
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}  18460.17
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0591
{txt}{col 51}Root MSE{col 67}=    {res} 1.3256

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}ln_us80a_fto~1995{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2} .0271463{col 31}{space 2} .0681669{col 42}{space 1}    0.40{col 51}{space 3}0.690{col 59}{space 4}-.1064583{col 72}{space 3} .1607509
{txt}morethantwo_black {c |}{col 19}{res}{space 2}-.6652769{col 31}{space 2} .4111518{col 42}{space 1}   -1.62{col 51}{space 3}0.106{col 59}{space 4} -1.47112{col 72}{space 3} .1405657
{txt}{space 14}age {c |}{col 19}{res}{space 2} .0464711{col 31}{space 2} .0025888{col 42}{space 1}   17.95{col 51}{space 3}0.000{col 59}{space 4} .0413972{col 72}{space 3} .0515451
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2} .0333186{col 31}{space 2} .0037235{col 42}{space 1}    8.95{col 51}{space 3}0.000{col 59}{space 4} .0260206{col 72}{space 3} .0406167
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2} .0071695{col 31}{space 2}  .004247{col 42}{space 1}    1.69{col 51}{space 3}0.091{col 59}{space 4}-.0011546{col 72}{space 3} .0154935
{txt}{space 12}black {c |}{col 19}{res}{space 2}-.2876053{col 31}{space 2} .2064966{col 42}{space 1}   -1.39{col 51}{space 3}0.164{col 59}{space 4}-.6923312{col 72}{space 3} .1171207
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2}-.5115812{col 31}{space 2} .0192821{col 42}{space 1}  -26.53{col 51}{space 3}0.000{col 59}{space 4}-.5493734{col 72}{space 3}-.4737889
{txt}{space 7}other_race {c |}{col 19}{res}{space 2}-.2313238{col 31}{space 2}  .016334{col 42}{space 1}  -14.16{col 51}{space 3}0.000{col 59}{space 4}-.2633379{col 72}{space 3}-.1993097
{txt}{space 12}_cons {c |}{col 19}{res}{space 2} 8.289245{col 31}{space 2} .0344376{col 42}{space 1}  240.70{col 51}{space 3}0.000{col 59}{space 4} 8.221749{col 72}{space 3} 8.356742
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls twoboysgirls_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_allwomen_iv2.txt""':seeout}

{com}. 
. * 2) Married women
. foreach var of varlist workedforpay us80a_wkswork1 us80a_uhrswork labor_income_1995 ln_us80a_ftotinc_1995 {c -(}
{txt}  2{com}.         ivregress 2sls `var' (morethantwo morethantwo_black = samesex samesex_black) age age_firstbirth boyfirst boysecond black hispanic other_race if married == 1, r
{txt}  3{com}.         outreg2 using table_new_marriedwomen_iv, keep(morethantwo morethantwo_black) nocon ctitle(All Women - IV(samesex, samesex_black), `var')
{txt}  4{com}. {c )-}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}9{txt}){col 67}= {res}   7270.45
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0474
{txt}{col 51}Root MSE{col 67}=    {res} .48737

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}     workedforpay{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2}-.1198828{col 31}{space 2} .0289053{col 42}{space 1}   -4.15{col 51}{space 3}0.000{col 59}{space 4}-.1765361{col 72}{space 3}-.0632296
{txt}morethantwo_black {c |}{col 19}{res}{space 2}-.1187836{col 31}{space 2} .1350322{col 42}{space 1}   -0.88{col 51}{space 3}0.379{col 59}{space 4}-.3834419{col 72}{space 3} .1458747
{txt}{space 14}age {c |}{col 19}{res}{space 2} .0223638{col 31}{space 2} .0009632{col 42}{space 1}   23.22{col 51}{space 3}0.000{col 59}{space 4}  .020476{col 72}{space 3} .0242515
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2}-.0269397{col 31}{space 2} .0013356{col 42}{space 1}  -20.17{col 51}{space 3}0.000{col 59}{space 4}-.0295574{col 72}{space 3} -.024322
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2} .0003101{col 31}{space 2} .0019615{col 42}{space 1}    0.16{col 51}{space 3}0.874{col 59}{space 4}-.0035344{col 72}{space 3} .0041546
{txt}{space 8}boysecond {c |}{col 19}{res}{space 2}-.0038129{col 31}{space 2} .0019608{col 42}{space 1}   -1.94{col 51}{space 3}0.052{col 59}{space 4} -.007656{col 72}{space 3} .0000301
{txt}{space 12}black {c |}{col 19}{res}{space 2} .2446365{col 31}{space 2} .0597633{col 42}{space 1}    4.09{col 51}{space 3}0.000{col 59}{space 4} .1275025{col 72}{space 3} .3617705
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2} .0130036{col 31}{space 2} .0078428{col 42}{space 1}    1.66{col 51}{space 3}0.097{col 59}{space 4}-.0023679{col 72}{space 3} .0283751
{txt}{space 7}other_race {c |}{col 19}{res}{space 2} .0563054{col 31}{space 2} .0060202{col 42}{space 1}    9.35{col 51}{space 3}0.000{col 59}{space 4} .0445061{col 72}{space 3} .0681046
{txt}{space 12}_cons {c |}{col 19}{res}{space 2} .4691606{col 31}{space 2}  .014638{col 42}{space 1}   32.05{col 51}{space 3}0.000{col 59}{space 4} .4404707{col 72}{space 3} .4978505
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex samesex_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_marriedwomen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}9{txt}){col 67}= {res}  11292.20
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0675
{txt}{col 51}Root MSE{col 67}=    {res} 21.042

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}   us80a_wkswork1{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2}-5.595721{col 31}{space 2} 1.240916{col 42}{space 1}   -4.51{col 51}{space 3}0.000{col 59}{space 4}-8.027871{col 72}{space 3}-3.163571
{txt}morethantwo_black {c |}{col 19}{res}{space 2}-1.735945{col 31}{space 2}  6.50787{col 42}{space 1}   -0.27{col 51}{space 3}0.790{col 59}{space 4}-14.49114{col 72}{space 3} 11.01925
{txt}{space 14}age {c |}{col 19}{res}{space 2} 1.289166{col 31}{space 2} .0416236{col 42}{space 1}   30.97{col 51}{space 3}0.000{col 59}{space 4} 1.207585{col 72}{space 3} 1.370747
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2}-1.278293{col 31}{space 2} .0580086{col 42}{space 1}  -22.04{col 51}{space 3}0.000{col 59}{space 4}-1.391988{col 72}{space 3}-1.164598
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2}-.0453332{col 31}{space 2} .0846915{col 42}{space 1}   -0.54{col 51}{space 3}0.592{col 59}{space 4}-.2113255{col 72}{space 3} .1206592
{txt}{space 8}boysecond {c |}{col 19}{res}{space 2}  -.11032{col 31}{space 2}  .084655{col 42}{space 1}   -1.30{col 51}{space 3}0.193{col 59}{space 4}-.2762407{col 72}{space 3} .0556008
{txt}{space 12}black {c |}{col 19}{res}{space 2} 11.43259{col 31}{space 2} 2.886299{col 42}{space 1}    3.96{col 51}{space 3}0.000{col 59}{space 4} 5.775553{col 72}{space 3} 17.08964
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2} .7805741{col 31}{space 2} .3325328{col 42}{space 1}    2.35{col 51}{space 3}0.019{col 59}{space 4} .1288219{col 72}{space 3} 1.432326
{txt}{space 7}other_race {c |}{col 19}{res}{space 2} 3.907109{col 31}{space 2}  .271727{col 42}{space 1}   14.38{col 51}{space 3}0.000{col 59}{space 4} 3.374534{col 72}{space 3} 4.439684
{txt}{space 12}_cons {c |}{col 19}{res}{space 2} 9.066744{col 31}{space 2} .6170087{col 42}{space 1}   14.69{col 51}{space 3}0.000{col 59}{space 4} 7.857429{col 72}{space 3} 10.27606
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex samesex_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_marriedwomen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}9{txt}){col 67}= {res}  10930.51
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0629
{txt}{col 51}Root MSE{col 67}=    {res} 17.727

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}   us80a_uhrswork{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2}-5.015581{col 31}{space 2} 1.045267{col 42}{space 1}   -4.80{col 51}{space 3}0.000{col 59}{space 4}-7.064266{col 72}{space 3}-2.966895
{txt}morethantwo_black {c |}{col 19}{res}{space 2}-.6263965{col 31}{space 2} 5.488925{col 42}{space 1}   -0.11{col 51}{space 3}0.909{col 59}{space 4}-11.38449{col 72}{space 3}  10.1317
{txt}{space 14}age {c |}{col 19}{res}{space 2} .7942999{col 31}{space 2} .0351467{col 42}{space 1}   22.60{col 51}{space 3}0.000{col 59}{space 4} .7254136{col 72}{space 3} .8631862
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2}-1.264688{col 31}{space 2} .0488034{col 42}{space 1}  -25.91{col 51}{space 3}0.000{col 59}{space 4}-1.360341{col 72}{space 3}-1.169035
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2} .0437252{col 31}{space 2} .0713304{col 42}{space 1}    0.61{col 51}{space 3}0.540{col 59}{space 4}-.0960798{col 72}{space 3} .1835303
{txt}{space 8}boysecond {c |}{col 19}{res}{space 2} -.103965{col 31}{space 2} .0713677{col 42}{space 1}   -1.46{col 51}{space 3}0.145{col 59}{space 4} -.243843{col 72}{space 3} .0359131
{txt}{space 12}black {c |}{col 19}{res}{space 2} 9.997881{col 31}{space 2} 2.433346{col 42}{space 1}    4.11{col 51}{space 3}0.000{col 59}{space 4} 5.228611{col 72}{space 3} 14.76715
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2} 2.754518{col 31}{space 2} .2981023{col 42}{space 1}    9.24{col 51}{space 3}0.000{col 59}{space 4} 2.170249{col 72}{space 3} 3.338788
{txt}{space 7}other_race {c |}{col 19}{res}{space 2} 5.025329{col 31}{space 2} .2384763{col 42}{space 1}   21.07{col 51}{space 3}0.000{col 59}{space 4} 4.557925{col 72}{space 3} 5.492734
{txt}{space 12}_cons {c |}{col 19}{res}{space 2} 21.25387{col 31}{space 2} .5327973{col 42}{space 1}   39.89{col 51}{space 3}0.000{col 59}{space 4} 20.20961{col 72}{space 3} 22.29813
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex samesex_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_marriedwomen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}9{txt}){col 67}= {res}   8113.36
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0456
{txt}{col 51}Root MSE{col 67}=    {res} 9942.4

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}labor_income_1995{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2}-1542.416{col 31}{space 2} 577.4462{col 42}{space 1}   -2.67{col 51}{space 3}0.008{col 59}{space 4} -2674.19{col 72}{space 3}-410.6424
{txt}morethantwo_black {c |}{col 19}{res}{space 2} 4210.916{col 31}{space 2} 3762.315{col 42}{space 1}    1.12{col 51}{space 3}0.263{col 59}{space 4}-3163.087{col 72}{space 3} 11584.92
{txt}{space 14}age {c |}{col 19}{res}{space 2} 475.4051{col 31}{space 2} 19.68271{col 42}{space 1}   24.15{col 51}{space 3}0.000{col 59}{space 4} 436.8277{col 72}{space 3} 513.9825
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2}-261.2694{col 31}{space 2} 27.90863{col 42}{space 1}   -9.36{col 51}{space 3}0.000{col 59}{space 4}-315.9693{col 72}{space 3}-206.5695
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2} 18.59208{col 31}{space 2} 40.08319{col 42}{space 1}    0.46{col 51}{space 3}0.643{col 59}{space 4}-59.96953{col 72}{space 3} 97.15369
{txt}{space 8}boysecond {c |}{col 19}{res}{space 2}  16.9674{col 31}{space 2} 39.95037{col 42}{space 1}    0.42{col 51}{space 3}0.671{col 59}{space 4}-61.33389{col 72}{space 3} 95.26868
{txt}{space 12}black {c |}{col 19}{res}{space 2}  4201.92{col 31}{space 2} 1665.291{col 42}{space 1}    2.52{col 51}{space 3}0.012{col 59}{space 4} 938.0085{col 72}{space 3} 7465.831
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2} 830.4551{col 31}{space 2} 156.2486{col 42}{space 1}    5.31{col 51}{space 3}0.000{col 59}{space 4} 524.2134{col 72}{space 3} 1136.697
{txt}{space 7}other_race {c |}{col 19}{res}{space 2} 3232.233{col 31}{space 2} 158.6189{col 42}{space 1}   20.38{col 51}{space 3}0.000{col 59}{space 4} 2921.346{col 72}{space 3} 3543.121
{txt}{space 12}_cons {c |}{col 19}{res}{space 2}-2418.521{col 31}{space 2}  290.019{col 42}{space 1}   -8.34{col 51}{space 3}0.000{col 59}{space 4}-2986.947{col 72}{space 3}-1850.094
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex samesex_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_marriedwomen_iv.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}9{txt}){col 67}= {res}   7683.39
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0363
{txt}{col 51}Root MSE{col 67}=    {res} 1.0294

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}ln_us80a_fto~1995{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2}-.0461087{col 31}{space 2} .0603741{col 42}{space 1}   -0.76{col 51}{space 3}0.445{col 59}{space 4}-.1644398{col 72}{space 3} .0722223
{txt}morethantwo_black {c |}{col 19}{res}{space 2} -.069898{col 31}{space 2} .3526045{col 42}{space 1}   -0.20{col 51}{space 3}0.843{col 59}{space 4}-.7609901{col 72}{space 3}  .621194
{txt}{space 14}age {c |}{col 19}{res}{space 2} .0407293{col 31}{space 2} .0020654{col 42}{space 1}   19.72{col 51}{space 3}0.000{col 59}{space 4} .0366812{col 72}{space 3} .0447775
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2} .0227181{col 31}{space 2} .0028649{col 42}{space 1}    7.93{col 51}{space 3}0.000{col 59}{space 4} .0171029{col 72}{space 3} .0283332
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2}  .008607{col 31}{space 2} .0041492{col 42}{space 1}    2.07{col 51}{space 3}0.038{col 59}{space 4} .0004748{col 72}{space 3} .0167392
{txt}{space 8}boysecond {c |}{col 19}{res}{space 2} .0017665{col 31}{space 2} .0041257{col 42}{space 1}    0.43{col 51}{space 3}0.669{col 59}{space 4}-.0063197{col 72}{space 3} .0098526
{txt}{space 12}black {c |}{col 19}{res}{space 2}-.1184566{col 31}{space 2} .1557009{col 42}{space 1}   -0.76{col 51}{space 3}0.447{col 59}{space 4}-.4236248{col 72}{space 3} .1867115
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2}-.3352171{col 31}{space 2} .0193279{col 42}{space 1}  -17.34{col 51}{space 3}0.000{col 59}{space 4} -.373099{col 72}{space 3}-.2973351
{txt}{space 7}other_race {c |}{col 19}{res}{space 2}-.1952208{col 31}{space 2} .0177991{col 42}{space 1}  -10.97{col 51}{space 3}0.000{col 59}{space 4}-.2301063{col 72}{space 3}-.1603352
{txt}{space 12}_cons {c |}{col 19}{res}{space 2} 8.857052{col 31}{space 2} .0310305{col 42}{space 1}  285.43{col 51}{space 3}0.000{col 59}{space 4} 8.796234{col 72}{space 3} 8.917871
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst boysecond black hispanic other_race samesex samesex_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_marriedwomen_iv.txt""':seeout}

{com}. 
. foreach var of varlist workedforpay us80a_wkswork1 us80a_uhrswork labor_income_1995 ln_us80a_ftotinc_1995 {c -(}
{txt}  2{com}.         ivregress 2sls `var' (morethantwo morethantwo_black = twoboysgirls twoboysgirls_black) age age_firstbirth boyfirst black hispanic other_race if married == 1, r
{txt}  3{com}.         outreg2 using table_new_marriedwomen_iv2, keep(morethantwo morethantwo_black) nocon ctitle(All Women - IV(twoboysgirls, twoboysgirls_black), `var') 
{txt}  4{com}. {c )-}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}   7268.12
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0475
{txt}{col 51}Root MSE{col 67}=    {res} .48735

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}     workedforpay{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2}-.1214974{col 31}{space 2} .0290233{col 42}{space 1}   -4.19{col 51}{space 3}0.000{col 59}{space 4} -.178382{col 72}{space 3}-.0646128
{txt}morethantwo_black {c |}{col 19}{res}{space 2}-.1184934{col 31}{space 2} .1350523{col 42}{space 1}   -0.88{col 51}{space 3}0.380{col 59}{space 4} -.383191{col 72}{space 3} .1462041
{txt}{space 14}age {c |}{col 19}{res}{space 2} .0224148{col 31}{space 2} .0009665{col 42}{space 1}   23.19{col 51}{space 3}0.000{col 59}{space 4} .0205205{col 72}{space 3} .0243091
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2}-.0270134{col 31}{space 2} .0013404{col 42}{space 1}  -20.15{col 51}{space 3}0.000{col 59}{space 4}-.0296406{col 72}{space 3}-.0243863
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2} .0002572{col 31}{space 2} .0019618{col 42}{space 1}    0.13{col 51}{space 3}0.896{col 59}{space 4}-.0035879{col 72}{space 3} .0041023
{txt}{space 12}black {c |}{col 19}{res}{space 2} .2446424{col 31}{space 2} .0597695{col 42}{space 1}    4.09{col 51}{space 3}0.000{col 59}{space 4} .1274963{col 72}{space 3} .3617884
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2} .0132645{col 31}{space 2}  .007854{col 42}{space 1}    1.69{col 51}{space 3}0.091{col 59}{space 4}-.0021291{col 72}{space 3} .0286581
{txt}{space 7}other_race {c |}{col 19}{res}{space 2}  .056416{col 31}{space 2} .0060218{col 42}{space 1}    9.37{col 51}{space 3}0.000{col 59}{space 4} .0446134{col 72}{space 3} .0682185
{txt}{space 12}_cons {c |}{col 19}{res}{space 2} .4678756{col 31}{space 2} .0145462{col 42}{space 1}   32.16{col 51}{space 3}0.000{col 59}{space 4} .4393657{col 72}{space 3} .4963855
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls twoboysgirls_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_marriedwomen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}  11291.97
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0676
{txt}{col 51}Root MSE{col 67}=    {res} 21.041

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}   us80a_wkswork1{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2}-5.642434{col 31}{space 2} 1.246006{col 42}{space 1}   -4.53{col 51}{space 3}0.000{col 59}{space 4}-8.084562{col 72}{space 3}-3.200307
{txt}morethantwo_black {c |}{col 19}{res}{space 2}-1.727549{col 31}{space 2} 6.507949{col 42}{space 1}   -0.27{col 51}{space 3}0.791{col 59}{space 4}-14.48289{col 72}{space 3}  11.0278
{txt}{space 14}age {c |}{col 19}{res}{space 2} 1.290642{col 31}{space 2} .0417642{col 42}{space 1}   30.90{col 51}{space 3}0.000{col 59}{space 4} 1.208786{col 72}{space 3} 1.372499
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2}-1.280426{col 31}{space 2} .0582128{col 42}{space 1}  -22.00{col 51}{space 3}0.000{col 59}{space 4}-1.394521{col 72}{space 3}-1.166331
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2}-.0468633{col 31}{space 2} .0846975{col 42}{space 1}   -0.55{col 51}{space 3}0.580{col 59}{space 4}-.2128673{col 72}{space 3} .1191407
{txt}{space 12}black {c |}{col 19}{res}{space 2} 11.43276{col 31}{space 2} 2.886214{col 42}{space 1}    3.96{col 51}{space 3}0.000{col 59}{space 4}  5.77589{col 72}{space 3} 17.08964
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2} .7881218{col 31}{space 2} .3330186{col 42}{space 1}    2.37{col 51}{space 3}0.018{col 59}{space 4} .1354175{col 72}{space 3} 1.440826
{txt}{space 7}other_race {c |}{col 19}{res}{space 2} 3.910309{col 31}{space 2} .2718025{col 42}{space 1}   14.39{col 51}{space 3}0.000{col 59}{space 4} 3.377586{col 72}{space 3} 4.443032
{txt}{space 12}_cons {c |}{col 19}{res}{space 2} 9.029564{col 31}{space 2} .6129411{col 42}{space 1}   14.73{col 51}{space 3}0.000{col 59}{space 4} 7.828222{col 72}{space 3} 10.23091
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls twoboysgirls_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_marriedwomen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}  10930.32
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0630
{txt}{col 51}Root MSE{col 67}=    {res} 17.727

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}   us80a_uhrswork{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2}-5.059603{col 31}{space 2} 1.049724{col 42}{space 1}   -4.82{col 51}{space 3}0.000{col 59}{space 4}-7.117025{col 72}{space 3}-3.002181
{txt}morethantwo_black {c |}{col 19}{res}{space 2} -.618484{col 31}{space 2} 5.489041{col 42}{space 1}   -0.11{col 51}{space 3}0.910{col 59}{space 4}-11.37681{col 72}{space 3} 10.13984
{txt}{space 14}age {c |}{col 19}{res}{space 2} .7956911{col 31}{space 2} .0352692{col 42}{space 1}   22.56{col 51}{space 3}0.000{col 59}{space 4} .7265648{col 72}{space 3} .8648174
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2}-1.266699{col 31}{space 2} .0489813{col 42}{space 1}  -25.86{col 51}{space 3}0.000{col 59}{space 4}  -1.3627{col 72}{space 3}-1.170697
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2} .0422833{col 31}{space 2} .0713361{col 42}{space 1}    0.59{col 51}{space 3}0.553{col 59}{space 4}-.0975329{col 72}{space 3} .1820994
{txt}{space 12}black {c |}{col 19}{res}{space 2} 9.998042{col 31}{space 2} 2.433291{col 42}{space 1}    4.11{col 51}{space 3}0.000{col 59}{space 4}  5.22888{col 72}{space 3}  14.7672
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2} 2.761631{col 31}{space 2} .2985158{col 42}{space 1}    9.25{col 51}{space 3}0.000{col 59}{space 4} 2.176551{col 72}{space 3} 3.346712
{txt}{space 7}other_race {c |}{col 19}{res}{space 2} 5.028345{col 31}{space 2} .2385391{col 42}{space 1}   21.08{col 51}{space 3}0.000{col 59}{space 4} 4.560817{col 72}{space 3} 5.495873
{txt}{space 12}_cons {c |}{col 19}{res}{space 2} 21.21883{col 31}{space 2} .5293919{col 42}{space 1}   40.08{col 51}{space 3}0.000{col 59}{space 4} 20.18124{col 72}{space 3} 22.25642
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls twoboysgirls_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_marriedwomen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}   8109.64
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0455
{txt}{col 51}Root MSE{col 67}=    {res} 9942.7

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}labor_income_1995{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2}-1535.231{col 31}{space 2} 579.7764{col 42}{space 1}   -2.65{col 51}{space 3}0.008{col 59}{space 4}-2671.572{col 72}{space 3}-398.8906
{txt}morethantwo_black {c |}{col 19}{res}{space 2} 4209.624{col 31}{space 2}  3762.67{col 42}{space 1}    1.12{col 51}{space 3}0.263{col 59}{space 4}-3165.073{col 72}{space 3} 11584.32
{txt}{space 14}age {c |}{col 19}{res}{space 2} 475.1781{col 31}{space 2}  19.7441{col 42}{space 1}   24.07{col 51}{space 3}0.000{col 59}{space 4} 436.4803{col 72}{space 3} 513.8758
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2}-260.9413{col 31}{space 2} 27.99394{col 42}{space 1}   -9.32{col 51}{space 3}0.000{col 59}{space 4}-315.8084{col 72}{space 3}-206.0742
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2} 18.82742{col 31}{space 2} 40.09989{col 42}{space 1}    0.47{col 51}{space 3}0.639{col 59}{space 4}-59.76692{col 72}{space 3} 97.42175
{txt}{space 12}black {c |}{col 19}{res}{space 2} 4201.893{col 31}{space 2} 1665.377{col 42}{space 1}    2.52{col 51}{space 3}0.012{col 59}{space 4} 937.8135{col 72}{space 3} 7465.973
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2} 829.2943{col 31}{space 2}  156.498{col 42}{space 1}    5.30{col 51}{space 3}0.000{col 59}{space 4} 522.5639{col 72}{space 3} 1136.025
{txt}{space 7}other_race {c |}{col 19}{res}{space 2} 3231.741{col 31}{space 2} 158.6466{col 42}{space 1}   20.37{col 51}{space 3}0.000{col 59}{space 4}   2920.8{col 72}{space 3} 3542.683
{txt}{space 12}_cons {c |}{col 19}{res}{space 2}-2412.802{col 31}{space 2} 288.2674{col 42}{space 1}   -8.37{col 51}{space 3}0.000{col 59}{space 4}-2977.796{col 72}{space 3}-1847.809
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls twoboysgirls_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_marriedwomen_iv2.txt""':seeout}
{res}
{txt}{col 1}Instrumental variables 2SLS regression{col 51}Number of obs{col 67}= {res}   251,646
{txt}{col 1}{col 51}Wald chi2({res}8{txt}){col 67}= {res}   7680.51
{txt}{col 1}{col 51}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 1}{col 51}R-squared{col 67}= {res}    0.0363
{txt}{col 51}Root MSE{col 67}=    {res} 1.0294

{txt}{hline 18}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 19}{c |}{col 31}    Robust
{col 1}ln_us80a_fto~1995{col 19}{c |} Coefficient{col 31}  std. err.{col 43}      z{col 51}   P>|z|{col 59}     [95% con{col 72}f. interval]
{hline 18}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}morethantwo {c |}{col 19}{res}{space 2}-.0453607{col 31}{space 2} .0605625{col 42}{space 1}   -0.75{col 51}{space 3}0.454{col 59}{space 4}-.1640611{col 72}{space 3} .0733396
{txt}morethantwo_black {c |}{col 19}{res}{space 2}-.0700325{col 31}{space 2} .3526321{col 42}{space 1}   -0.20{col 51}{space 3}0.843{col 59}{space 4}-.7611787{col 72}{space 3} .6211138
{txt}{space 14}age {c |}{col 19}{res}{space 2} .0407057{col 31}{space 2} .0020699{col 42}{space 1}   19.67{col 51}{space 3}0.000{col 59}{space 4} .0366487{col 72}{space 3} .0447627
{txt}{space 3}age_firstbirth {c |}{col 19}{res}{space 2} .0227522{col 31}{space 2} .0028709{col 42}{space 1}    7.93{col 51}{space 3}0.000{col 59}{space 4} .0171253{col 72}{space 3} .0283792
{txt}{space 9}boyfirst {c |}{col 19}{res}{space 2} .0086315{col 31}{space 2} .0041492{col 42}{space 1}    2.08{col 51}{space 3}0.037{col 59}{space 4} .0004992{col 72}{space 3} .0167637
{txt}{space 12}black {c |}{col 19}{res}{space 2}-.1184594{col 31}{space 2} .1557016{col 42}{space 1}   -0.76{col 51}{space 3}0.447{col 59}{space 4} -.423629{col 72}{space 3} .1867102
{txt}{space 9}hispanic {c |}{col 19}{res}{space 2}-.3353379{col 31}{space 2} .0193442{col 42}{space 1}  -17.34{col 51}{space 3}0.000{col 59}{space 4}-.3732518{col 72}{space 3} -.297424
{txt}{space 7}other_race {c |}{col 19}{res}{space 2} -.195272{col 31}{space 2}  .017801{col 42}{space 1}  -10.97{col 51}{space 3}0.000{col 59}{space 4}-.2301613{col 72}{space 3}-.1603827
{txt}{space 12}_cons {c |}{col 19}{res}{space 2} 8.857648{col 31}{space 2} .0308967{col 42}{space 1}  286.69{col 51}{space 3}0.000{col 59}{space 4} 8.797091{col 72}{space 3} 8.918204
{txt}{hline 18}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{p 0 14 24}Instrumented: {res:morethantwo morethantwo_black}{p_end}
{p 0 14 24}{space 1}Instruments: {res:age age_firstbirth boyfirst black hispanic other_race twoboysgirls twoboysgirls_black}{p_end}
{browse `"/Users/yujinlee/Google Drive/NYU/Fall 2022/AEM/Replication_Exercise"' :dir}{com} : {txt}{stata `"seeout using "table_new_marriedwomen_iv2.txt""':seeout}

{com}. 
. capture log close
{smcl}
{com}{sf}{ul off}